makarioussafa/Rovey_Mobile_Robot/Hardware_Codes/PID_ESP32_USB_SERIAL_ROS2_GUI_TCP_IMU_DIAG__copy_20260618051121.ino
// ============================================================
// ESP32 Mecanum Robot - Predefined Path + Obstacle Avoidance
// MASTER ESP32
//
// micro-ROS NODE: PID / drivetrain / path / obstacle decision node.
// No HTTP server is started. Communication is through ROS 2 topics via
// USB serial micro-ROS agents running on the Raspberry Pi.
//
// Obstacle handling logic:
//   ANY stable sensor detection stops the robot immediately.
//   The sensor ESP32 sends a debounced/stable mask, not raw flicker.
//
//   SIDE-ONLY CASES:
//     S1 only, S3 only, or S1+S3 without S2:
//       stop -> wait until side sensors clear -> wait 3 stable seconds
//       -> continue the same path segment.
//
//   FRONT CASES:
//     S2 only, S1+S2, or S2+S3:
//       stop -> 5 s static/dynamic check.
//       If all sensors clear -> dynamic obstacle -> continue same segment.
//       If S2 remains active -> arm Pi toy recognition.
//       If TOY is confirmed -> move forward 12 cm -> wait for mechanism task
//         and homing to finish -> continue path.
//       If no TOY is confirmed -> perform full avoidance sequence:
//         rotate +90 for the normal S2-only case -> drive side offset
//         -> rotate back to path heading -> drive forward bypass
//         -> rotate -90 -> drive side offset -> rotate back to path heading
//         -> continue path.
//
//   FULL BLOCK CASE:
//     S1+S2+S3:
//       stop and wait indefinitely while all three are active.
//       When any sensor clears, re-evaluate the new mask using the rules above.
//
// ROS 2 / micro-ROS alignment:
//   This PID ESP32 subscribes to sensor/mecanism topics from the
//   Sensor/Mechanism ESP32 and publishes command topics back to it.
//   MPU6050 remains on local I2C; ESP-to-ESP I2C is no longer used.
// ============================================================

#include <Arduino.h>
// WiFi transport removed: USB serial micro-ROS is used.
#include <Wire.h>
#include <math.h>
#include "driver/gpio.h"
#include <freertos/queue.h>

#include <micro_ros_arduino.h>
#include <rcl/rcl.h>
#include <rcl/error_handling.h>
#include <rclc/rclc.h>
#include <rclc/executor.h>
#include <rmw_microros/rmw_microros.h>
#include <std_msgs/msg/u_int8.h>
#include <std_msgs/msg/u_int16.h>
#include <std_msgs/msg/int32.h>
#include <std_msgs/msg/bool.h>

#if __has_include(<esp_arduino_version.h>)
#include <esp_arduino_version.h>
#endif

#ifndef ESP_ARDUINO_VERSION_MAJOR
#define ESP_ARDUINO_VERSION_MAJOR 2
#endif

// =====================================================
// USB SERIAL micro-ROS IMPORTANT NOTE
// =====================================================
// The ESP32 USB Serial port is reserved exclusively for micro-ROS XRCE-DDS.
// Do NOT print normal debug text to Serial while the micro-ROS serial agent is running,
// because debug bytes will corrupt the micro-ROS stream.
// Debug prints are redirected to this no-op object. Use ROS 2 topics on the Pi for monitoring.
struct NullDebugSerialClass {
  void begin(unsigned long) {}
  template<typename... Args> void print(Args...) {}
  template<typename... Args> void println(Args...) {}
  template<typename... Args> void printf(const char*, Args...) {}
};
static NullDebugSerialClass DebugSerial;

// =====================================================
// USB Serial - micro-ROS transport
// =====================================================
#define MICRO_ROS_SERIAL_BAUD 115200

// =====================================================
// IMU Pins and Address
// =====================================================
#define SDA_PIN   21
#define SCL_PIN   22
#define MPU_ADDR  0x68

// =====================================================
// Motor Pin Definitions
// =====================================================
#define BR_DN1       0
#define BR_DN2       2
#define BR_PWM_PIN  15

#define FL_DN1      25
#define FL_DN2      33

#define FR_DN1      26
#define FR_DN2      27

#define BL_DN1       4
#define BL_DN2      16

#define FL_PWM_PIN  32
#define FR_PWM_PIN  14
#define BL_PWM_PIN  17

// =====================================================
// Encoder Pin Definitions
// =====================================================
#define FL_A  35
#define FL_B  34

#define FR_A  36
#define FR_B  39

#define BL_A  23
#define BL_B  19

#define BR_A   5
#define BR_B  18

// =====================================================
// Robot and Motor Constants
// =====================================================
#define WHEEL_R     0.0485f
#define ROBOT_LW    0.31828f
#define MAX_RAD_S   21.99f
#define MAX_MPS     (MAX_RAD_S * WHEEL_R)
#define MAX_WZ      2.3f

const float CPR[4] = {
  1562.0f,  // FL - measured from run_encoder_imuPPr.csv, one output-shaft revolution
  1579.0f,  // FR
  1635.0f,  // BL
  1618.0f   // BR
};

// Wheel coordinate correction.
// Order is FL, FR, BL, BR.
//
// MOTOR_SIGN fixes motor-driver polarity only. The new FL JGA25-370 motor
// drives opposite to the other three motors for the same H-bridge command,
// so FL must be inverted here instead of changing the mecanum equations.
//
// ENCODER_SIGN is intentionally separate. Leave FL at +1 first: after the FL
// motor output is inverted, a correct forward wheel rotation should report
// positive encoder ticks. Change only this constant if a lifted-wheel test
// proves a wheel's encoder counts opposite to the robot-coordinate direction.
const int8_t MOTOR_SIGN[4] = {
  -1,  // FL
  +1,  // FR
  +1,  // BL
  +1   // BR
};

const int8_t ENCODER_SIGN[4] = {
  +1,  // FL
  +1,  // FR
  +1,  // BL
  +1   // BR
};

// =====================================================
// PWM Settings
// =====================================================
#define PWM_FREQ      5000
#define PWM_RES_BITS  8
#define PWM_MIN       130
#define PWM_MIN_MOVE  130
#define PWM_MIN_LATERAL 185
#define PWM_MIN_TURN  215
#define PWM_MIN_REAR_OPPOSED  190
#define PWM_MAX       255

#define WHEEL_FF_GAIN                 0.18f
#define WHEEL_RESPONSE_SETPOINT_RAD_S 3.0f
#define WHEEL_RESPONSE_MIN_RATIO      0.35f
#define WHEEL_RESPONSE_RELEASE_RATIO  0.55f
#define WHEEL_WRONG_DIR_RAD_S         0.70f
#define WHEEL_STALL_TIME_MS           160u
#define WHEEL_RECOVERY_STEP_PWM       35
#define WHEEL_RECOVERY_MAX_PWM        120
#define WHEEL_RECOVERY_DECAY_PWM      4
#define WHEEL_RECOVERY_STEP_PERIOD_MS 80u
#define REAR_OPPOSED_ASSIST_PWM       35

#define FL_PWM_CH  0
#define FR_PWM_CH  1
#define BL_PWM_CH  2
#define BR_PWM_CH  3

