makarioussafa/Rovey_Mobile_Robot/Hardware_Codes/PID_ESP32_USB_SERIAL_ROS2_GUI_TCP_IMU_DIAG__copy_20260618051121.ino
// =====================================================
// PID Loop
// =====================================================
#define PID_HZ  100
#define PID_DT  (1.0f / PID_HZ)
#define PLANNER_HZ  100
#define PLANNER_DT  (1.0f / PLANNER_HZ)

// =====================================================
// Motion Profile
// =====================================================
#define ACCEL_TIME    0.70f
#define DECEL_TIME    0.35f
#define ACCEL_TIME_W  0.38f
#define DECEL_TIME_W  0.18f

// =====================================================
// Move / Turn Controller
// =====================================================
#define DIST_TOLERANCE_M      0.015f
#define ANGLE_TOLERANCE_DEG   4.0f

#define SLOWDOWN_DISTANCE_M   0.25f
#define MIN_MOVE_SPEED_MPS    0.10f
#define MIN_TURN_WZ           0.95f

#define KP_MOVE_YAW        1.35f
#define KI_MOVE_YAW        0.25f
#define KD_MOVE_YAW        0.22f
#define MAX_MOVE_YAW_CORR  0.42f
#define MAX_MANUAL_YAW_CORR 0.72f
#define MANUAL_YAW_SLOWDOWN_DEG      10.0f
#define MANUAL_YAW_FULL_SLOWDOWN_DEG 35.0f
#define MANUAL_YAW_SLOWDOWN_RATE_DPS 25.0f
#define MANUAL_YAW_MIN_LINEAR_SCALE  0.35f
#define MOVE_YAW_I_LIMIT   0.35f
#define MOVE_YAW_DEADBAND_DEG      2.5f
#define MOVE_YAW_RATE_DEADBAND_DPS 2.0f
// Small encoder displacement trim only. Yaw hold is the primary line holder:
// if a segment starts at 0 deg and drifts to 55 deg, Wz drives back toward 0.
#define KP_CROSSTRACK       0.55f
#define MAX_CROSSTRACK_CORR_MPS 0.08f
#define CROSSTRACK_DEADBAND_M 0.020f
// Separate signs are used so straight-line yaw correction can be reversed
// without reversing the already-correct absolute turn commands.
#define MOVE_YAW_CONTROL_SIGN    1.0f
#define TURN_YAW_CONTROL_SIGN    1.0f

#define KP_TURN  3.20f
#define KD_TURN  0.24f
#define TURN_STOP_GYRO_DPS  4.5f
#define TURN_FINE_ZONE_DEG  30.0f
#define TURN_FINE_MIN_WZ    0.75f
#define TURN_STALL_GYRO_DPS 5.0f
#define TURN_STALL_TIME_MS  180u
#define TURN_STALL_BOOST_WZ 1.15f

// =====================================================
// Predefined Path + Obstacle Avoidance Settings
// =====================================================
// ESP-to-ESP communication is ROS 2 topics over USB serial micro-ROS through the Pi micro-ROS agent.

// ROS 2 topic protocol:
//   Subscribed from Sensor/Mechanism ESP32:
//     /robot/sensors/mask          std_msgs/UInt8   bit0=S1 right, bit1=S2 middle, bit2=S3 left
//     /robot/sensors/decision      std_msgs/UInt8   0=NONE, 1=TOY, 2=OBSTACLE
//     /robot/mechanism/state       std_msgs/UInt8   0=IDLE, 1=RUNNING, 2=DONE, 3=ERROR
//   Published to Sensor/Mechanism ESP32:
//     /robot/cmd/clear_decision    std_msgs/Bool    true pulse = clear consumed decision
//     /robot/cmd/arm_vision        std_msgs/Bool    true = arm Pi vision window
//     /robot/cmd/mechanism         std_msgs/UInt8   1=run pickup sequence after 12 cm approach
//     /robot/pid/encoder_packet    std_msgs/Int32   packed encoder + command diagnostics
//
#define DECISION_NONE      0u
#define DECISION_TOY       1u
#define DECISION_OBSTACLE  2u

#define MECH_STATE_IDLE     0u
#define MECH_STATE_RUNNING  1u
#define MECH_STATE_DONE     2u
#define MECH_STATE_ERROR    3u
#define MECH_CMD_RUN        1u

#define SENSOR_CMD_CLEAR_DECISION  0xA1u
#define SENSOR_CMD_ARM_VISION      0xA2u

#define GUI_MODE_MANUAL  0u
#define GUI_MODE_AUTO    1u

#define PID_GUI_CMD_MODE          1u
#define PID_GUI_CMD_AUTO_START    2u
#define PID_GUI_CMD_AUTO_ABORT    3u
#define PID_GUI_CMD_MANUAL_DRIVE  4u
#define PID_GUI_CMD_CAL_IMU       5u
#define PID_GUI_CMD_RESET_ZERO    6u

#define MANUAL_DIR_STOP        0u
#define MANUAL_DIR_FWD         1u
#define MANUAL_DIR_BACK        2u
#define MANUAL_DIR_LEFT        3u
#define MANUAL_DIR_RIGHT       4u
#define MANUAL_DIR_FWD_LEFT    5u
#define MANUAL_DIR_FWD_RIGHT   6u
#define MANUAL_DIR_BACK_LEFT   7u
#define MANUAL_DIR_BACK_RIGHT  8u
#define MANUAL_DIR_ROT_L       9u
#define MANUAL_DIR_ROT_R       10u

#define MANUAL_DRIVE_TIMEOUT_MS  450u
#define MANUAL_SPEED_MIN_PERCENT 60.0f

// PATH_SPEED_PERCENT controls the normal predefined forward segments only.
// TURN_SPEED_PERCENT controls only in-place turns.
// AVOID_SPEED_PERCENT controls only the turn/side-offset/forward/side-offset avoidance sequence.
// Keep path speed modest because straight-line behavior is now improved; tune turns/avoidance separately.
#define PATH_SPEED_PERCENT       30.0f
#define TURN_SPEED_PERCENT       60.0f
#define AVOID_SPEED_PERCENT      50.0f
#define MANUAL_LINEAR_SPEED_PERCENT 70.0f
#define MANUAL_LATERAL_SPEED_SCALE  0.70f

#define STATIC_CHECK_TIME_MS     5000
#define PI_TOY_WAIT_MS          15000
#define SIDE_CLEAR_CONTINUE_DELAY_MS 3000
#define AUTO_RESTART_AFTER_FINISH_MS 800u
#define AVOID_SIDE_DISTANCE_M    0.35f
#define AVOID_FORWARD_DISTANCE_M 1.20f
#define TOY_APPROACH_DISTANCE_M  0.12f
#define TOY_APPROACH_SPEED_PERCENT 25.0f

// Mask bits - a bit is SET when that sensor IS detecting
#define SENSOR_1_RIGHT_MASK   0x01
#define SENSOR_2_MIDDLE_MASK  0x02
#define SENSOR_3_LEFT_MASK    0x04

// =====================================================
// IMU Settings
// =====================================================
#define GYRO_SENS  131.0f
#define ACC_SENS   16384.0f

#define MPU_REG_WHO_AM_I       0x75
#define MPU_REG_PWR_MGMT_1     0x6B
#define MPU_REG_SMPLRT_DIV     0x19
#define MPU_REG_CONFIG         0x1A
#define MPU_REG_GYRO_CONFIG    0x1B
#define MPU_REG_ACCEL_CONFIG   0x1C
#define MPU_REG_ACCEL_XOUT_H   0x3B

#define IMU_CAL_SAMPLES  1200
#define IMU_TASK_MS      4
#define IMU_I2C_CLOCK_HZ 400000
#define IMU_LIVE_TIMEOUT_MS 500u

// =====================================================
// Wheel Index
// =====================================================
enum {
  W_FL = 0,
  W_FR = 1,
  W_BL = 2,
  W_BR = 3
};

// =====================================================
// Robot Mode
// =====================================================
enum RobotMode {
  MODE_IDLE = 0,
  MODE_MOVE_DISTANCE,
  MODE_STRAFE_DISTANCE,
  MODE_TURN_ANGLE
};

