makarioussafa/Rovey_Mobile_Robot/Hardware_Codes/PID_ESP32_USB_SERIAL_ROS2_GUI_TCP_IMU_DIAG__copy_20260618051121.ino
// =====================================================
// Motor Pin Map
// =====================================================
struct MotorPin {
  uint8_t dn1, dn2, pwm, ch;
};

const MotorPin MOT[4] = {
  { FL_DN1, FL_DN2, FL_PWM_PIN, FL_PWM_CH },
  { FR_DN1, FR_DN2, FR_PWM_PIN, FR_PWM_CH },
  { BL_DN1, BL_DN2, BL_PWM_PIN, BL_PWM_CH },
  { BR_DN1, BR_DN2, BR_PWM_PIN, BR_PWM_CH }
};

// =====================================================
// Encoder State
// =====================================================
static portMUX_TYPE encMux = portMUX_INITIALIZER_UNLOCKED;
volatile int32_t ticks[4] = {0, 0, 0, 0};
volatile uint32_t encoderResetGeneration = 0;

// =====================================================
// PID State
// =====================================================
struct WheelPID {
  float kp, ki, kd;
  float integral, prevErr;
  float integralLimit;
  float outMin, outMax;
};

WheelPID pid[4] = {
  // Lower Ki + lower PWM_MIN reduces wheel fighting, start jerk, and drift buildup.
  { 18.0f, 8.0f, 0.08f, 0.0f, 0.0f, 8.0f, -255.0f, 255.0f },  // FL
  { 17.0f, 8.0f, 0.08f, 0.0f, 0.0f, 8.0f, -255.0f, 255.0f },  // FR
  { 18.0f, 8.0f, 0.08f, 0.0f, 0.0f, 8.0f, -255.0f, 255.0f },  // BL
  { 17.0f, 8.0f, 0.08f, 0.0f, 0.0f, 8.0f, -255.0f, 255.0f }   // BR
};

volatile float   setpointRad[4]  = {0, 0, 0, 0};
volatile float   measuredRad[4]  = {0, 0, 0, 0};
volatile int16_t motorPwmOut[4]  = {0, 0, 0, 0};
volatile int16_t wheelRecoveryBoostPwm[4] = {0, 0, 0, 0};
uint32_t wheelBadResponseStartMs[4] = {0, 0, 0, 0};
uint32_t wheelLastRecoveryStepMs[4] = {0, 0, 0, 0};

// =====================================================
// Motion State
// =====================================================
volatile RobotMode robotMode = MODE_IDLE;
volatile float gSpd = 0.25f;

volatile float targVx = 0.0f, targVy = 0.0f, targWz = 0.0f;
volatile float profVx = 0.0f, profVy = 0.0f, profWz = 0.0f;

volatile float moveTargetDistanceM = 0.0f;
volatile float moveStartForwardM   = 0.0f;
volatile float moveStartLateralM   = 0.0f;
volatile float moveTargetYawDeg    = 0.0f;
volatile float moveDoneM           = 0.0f;
volatile float moveRemainingM      = 0.0f;

volatile float strafeTargetDistanceM = 0.0f;
volatile float strafeStartForwardM   = 0.0f;
volatile float strafeStartLateralM   = 0.0f;
volatile float strafeTargetYawDeg    = 0.0f;
volatile float strafeDoneM           = 0.0f;
volatile float strafeRemainingM      = 0.0f;

volatile float turnTargetYawDeg  = 0.0f;
volatile float turnAngleErrorDeg = 0.0f;
volatile float moveYawIntegralRad = 0.0f;
volatile uint32_t turnStallStartMs = 0;
volatile bool turnStallBoostActive = false;

volatile bool goalReached = false;

// =====================================================
// Odometry State
// =====================================================
volatile float odomX = 0.0f;
volatile float odomY = 0.0f;

// =====================================================
// IMU State
// =====================================================
volatile bool  imuReady                = false;
volatile bool  imuCalibrating          = false;
volatile bool  imuCalibrationRequested = false;
volatile bool  imuInitOk               = false;
volatile uint8_t imuWhoAmI             = 0;
volatile uint16_t imuCalibrationValidSamples = 0;
volatile uint16_t imuCalibrationTotalSamples = 0;

volatile float imuRollDeg  = 0.0f;
volatile float imuPitchDeg = 0.0f;
volatile float imuYawDeg   = 0.0f;

volatile float gyroXDegS = 0.0f;
volatile float gyroYDegS = 0.0f;
volatile float gyroZDegS = 0.0f;
volatile int16_t imuTempD10 = 0;
volatile int16_t imuRawAx = 0;
volatile int16_t imuRawAy = 0;
volatile int16_t imuRawAz = 0;
volatile int16_t imuRawGx = 0;
volatile int16_t imuRawGy = 0;
volatile int16_t imuRawGz = 0;

float axOffset = 0.0f, ayOffset = 0.0f, azOffset = 0.0f;
float gxOffset = 0.0f, gyOffset = 0.0f, gzOffset = 0.0f;

float accXf = 0.0f, accYf = 0.0f, accZf = 1.0f;
float gyroZf = 0.0f;

uint32_t lastImuMicros = 0;
volatile uint32_t imuReadOkCount = 0;
volatile uint32_t imuReadFailCount = 0;
volatile uint32_t imuReadInvalidCount = 0;
volatile uint32_t lastImuOkMs = 0;
volatile uint32_t lastImuFailMs = 0;

// =====================================================
// Status Tracking
// =====================================================
volatile char     lastCmd   = '-';
volatile uint32_t cmdCount  = 0;
volatile uint32_t lastCmdMs = 0;

// =====================================================
// Path / Obstacle State
// obstacleState values:
//   0 = clear
//   1 = detected / stopping
//   2 = waiting  (static-check or side-clear wait in progress)
//   3 = dynamic  (obstacle cleared, continuing)
//   4 = avoiding (full avoidance sequence in progress)
//   5 = all sensors blocked (waiting indefinitely until mask changes)
// =====================================================
SemaphoreHandle_t i2cMutex = NULL;   // protects the local MPU6050 I2C bus only

volatile uint8_t  sensorMask               = 0;
volatile uint8_t  userDecision             = DECISION_NONE;
volatile uint8_t  mechanismState           = MECH_STATE_IDLE;
volatile uint8_t  lastStaticObstacleMask   = 0;
volatile int8_t   lastAvoidSide            = 0;
volatile uint8_t  obstacleState            = 0;
volatile int      currentPathStep          = 0;
volatile bool     pathRunning              = false;
volatile bool     pathFinished             = false;
volatile bool     pathAborted              = false;
volatile float    currentSegmentDoneM      = 0.0f;
volatile float    currentSegmentRemainingM = 0.0f;

volatile uint8_t  guiMode                  = GUI_MODE_AUTO;  // AUTO is default, but waits for GUI start.
volatile bool     autoStartRequested       = false;
volatile bool     autoAbortRequested       = false;
volatile uint8_t  manualDriveDir           = MANUAL_DIR_STOP;
volatile uint8_t  manualDriveSpeed         = 0;
volatile uint32_t lastManualDriveMs        = 0;
volatile float    manualHoldYawDeg         = 0.0f;
volatile float    manualHoldForwardM       = 0.0f;
volatile float    manualHoldLateralM       = 0.0f;
volatile bool     manualHoldYawValid       = false;
volatile uint8_t  manualHoldYawDir         = MANUAL_DIR_STOP;
volatile uint8_t  lastGuiCommand           = 0;
volatile uint8_t  lastGuiDirection         = MANUAL_DIR_STOP;
volatile uint8_t  lastGuiValue             = 0;
volatile uint32_t lastGuiCommandMs         = 0;

// ROS sensor receive diagnostics
volatile uint32_t sensorReadOk   = 0;
volatile uint32_t sensorReadFail = 0;

