makarioussafa/Rovey_Mobile_Robot/Hardware_Codes/PID_ESP32_USB_SERIAL_ROS2_GUI_TCP_IMU_DIAG__copy_20260618051121.ino
// =====================================================
// micro-ROS State
// =====================================================
rcl_node_t ros_node;
rclc_support_t ros_support;
rcl_allocator_t ros_allocator;
rclc_executor_t ros_executor;

rcl_subscription_t sensor_mask_sub;
rcl_subscription_t decision_sub;
rcl_subscription_t mechanism_state_sub;
rcl_subscription_t pid_control_sub;
rcl_publisher_t clear_decision_pub;
rcl_publisher_t arm_vision_pub;
rcl_publisher_t mechanism_cmd_pub;
rcl_publisher_t pid_obstacle_state_pub;
rcl_publisher_t pid_path_step_pub;
rcl_publisher_t pid_path_flags_pub;
rcl_publisher_t pid_static_mask_pub;
rcl_publisher_t pid_imu_packet_pub;
rcl_publisher_t pid_encoder_packet_pub;

std_msgs__msg__UInt8 sensor_mask_msg;
std_msgs__msg__UInt8 decision_msg;
std_msgs__msg__UInt8 mechanism_state_msg;
std_msgs__msg__UInt16 pid_control_msg;
std_msgs__msg__Bool clear_decision_msg;
std_msgs__msg__Bool arm_vision_msg;
std_msgs__msg__UInt8 mechanism_cmd_msg;
std_msgs__msg__UInt8 pid_obstacle_state_msg;
std_msgs__msg__UInt8 pid_path_step_msg;
std_msgs__msg__UInt8 pid_path_flags_msg;
std_msgs__msg__UInt8 pid_static_mask_msg;
std_msgs__msg__Int32 pid_imu_packet_msg;
std_msgs__msg__Int32 pid_encoder_packet_msg;

volatile bool microRosReady = false;
volatile uint32_t rosSensorMaskRxCount = 0;
volatile uint32_t rosDecisionRxCount = 0;
volatile uint32_t rosMechanismRxCount = 0;
volatile uint32_t rosClearTxCount = 0;
volatile uint32_t rosArmTxCount = 0;
volatile uint32_t rosMechanismCmdTxCount = 0;
volatile uint32_t rosCommandQueueDropCount = 0;
volatile uint32_t rosPidStatusTxCount = 0;

#define ROS_CMD_CLEAR_DECISION        1u
#define ROS_CMD_ARM_VISION            2u
#define ROS_CMD_MECHANISM             3u
#define CLEAR_DECISION_BURST_COUNT    3u
#define ARM_VISION_BURST_COUNT        5u
#define MECHANISM_CMD_BURST_COUNT     5u
#define ROS_CMD_BURST_INTERVAL_MS     5u
#define ROS_PID_STATUS_PERIOD_MS      200u
#define IMU_PACKET_SCALE              100000L
#define IMU_PACKET_OFFSET             50000L
#define ENCODER_PACKET_SCALE          1000000L
#define ENCODER_PACKET_OFFSET         500000L

#define IMU_FIELD_YAW_CDEG    1L
#define IMU_FIELD_PITCH_CDEG  2L
#define IMU_FIELD_ROLL_CDEG   3L
#define IMU_FIELD_TEMP_D10    4L
#define IMU_FIELD_STATUS      5L
#define PID_FIELD_WHEEL_FL_PCT 6L
#define PID_FIELD_WHEEL_FR_PCT 7L
#define PID_FIELD_WHEEL_BL_PCT 8L
#define PID_FIELD_WHEEL_BR_PCT 9L
#define PID_FIELD_WHEEL_AVG_PCT 10L
#define IMU_FIELD_WHO_AM_I     11L
#define IMU_FIELD_READ_OK_MOD  12L
#define IMU_FIELD_READ_FAIL_MOD 13L
#define IMU_FIELD_CAL_VALID    14L
#define IMU_FIELD_LAST_OK_AGE_MS 15L
#define IMU_FIELD_INIT_OK      16L
#define IMU_FIELD_RAW_AX       17L
#define IMU_FIELD_RAW_AY       18L
#define IMU_FIELD_RAW_AZ       19L
#define IMU_FIELD_RAW_GX       20L
#define IMU_FIELD_RAW_GY       21L
#define IMU_FIELD_RAW_GZ       22L
#define IMU_FIELD_READ_INVALID_MOD 23L

#define ENC_FIELD_TICKS_FL             1L
#define ENC_FIELD_TICKS_FR             2L
#define ENC_FIELD_TICKS_BL             3L
#define ENC_FIELD_TICKS_BR             4L
#define ENC_FIELD_DELTA_FL             5L
#define ENC_FIELD_DELTA_FR             6L
#define ENC_FIELD_DELTA_BL             7L
#define ENC_FIELD_DELTA_BR             8L
#define ENC_FIELD_FORWARD_MM           9L
#define ENC_FIELD_LATERAL_MM          10L
#define ENC_FIELD_ODOM_X_MM           11L
#define ENC_FIELD_ODOM_Y_MM           12L
#define ENC_FIELD_ROBOT_MODE          13L
#define ENC_FIELD_GUI_MODE            14L
#define ENC_FIELD_MANUAL_DIR          15L
#define ENC_FIELD_MANUAL_SPEED        16L
#define ENC_FIELD_LAST_GUI_COMMAND    17L
#define ENC_FIELD_LAST_GUI_DIRECTION  18L
#define ENC_FIELD_LAST_GUI_VALUE      19L
#define ENC_FIELD_LAST_GUI_AGE_MS     20L
#define ENC_FIELD_PATH_STEP           21L
#define ENC_FIELD_OBSTACLE_STATE      22L
#define ENC_FIELD_PATH_FLAGS          23L
#define ENC_FIELD_SEGMENT_DONE_MM     24L
#define ENC_FIELD_SEGMENT_REMAIN_MM   25L
#define ENC_FIELD_TARGET_VX_MMS       26L
#define ENC_FIELD_TARGET_VY_MMS       27L
#define ENC_FIELD_TARGET_WZ_MRADS     28L
#define ENC_FIELD_PROFILE_VX_MMS      29L
#define ENC_FIELD_PROFILE_VY_MMS      30L
#define ENC_FIELD_PROFILE_WZ_MRADS    31L

struct RosCommand {
  uint8_t type;
  uint8_t value;
  uint8_t repeats;
};

QueueHandle_t rosCommandQueue = NULL;

#define RCCHECK(fn) { rcl_ret_t temp_rc = fn; if((temp_rc != RCL_RET_OK)){ DebugSerial.printf("micro-ROS error at line %d: %d\n", __LINE__, (int)temp_rc); return false; }}
#define RCSOFTCHECK(fn) { rcl_ret_t temp_rc = fn; if((temp_rc != RCL_RET_OK)){ DebugSerial.printf("micro-ROS soft error at line %d: %d\n", __LINE__, (int)temp_rc); }}

// =====================================================
// micro-ROS Helpers
// =====================================================
void softwareResetZeroState();
void readTicks(int32_t snap[4]);
float getForwardEncoderDistanceM();
float getLateralEncoderDistanceM();

uint8_t remapManualDirectionForOperatorView(uint8_t dir) {
  // The GUI labels stay unchanged. This swaps left/right at the firmware layer
  // for the operator standing face-to-face with the robot.
  switch (dir) {
    case MANUAL_DIR_LEFT:       return MANUAL_DIR_RIGHT;
    case MANUAL_DIR_RIGHT:      return MANUAL_DIR_LEFT;
    case MANUAL_DIR_FWD_LEFT:   return MANUAL_DIR_FWD_RIGHT;
    case MANUAL_DIR_FWD_RIGHT:  return MANUAL_DIR_FWD_LEFT;
    case MANUAL_DIR_BACK_LEFT:  return MANUAL_DIR_BACK_RIGHT;
    case MANUAL_DIR_BACK_RIGHT: return MANUAL_DIR_BACK_LEFT;
    default:                    return dir;
  }
}

bool manualDirectionAllowedBySensors(uint8_t dir) {
  uint8_t m = sensorMask & 0x07;

  if (dir == MANUAL_DIR_STOP ||
      dir == MANUAL_DIR_ROT_L ||
      dir == MANUAL_DIR_ROT_R) {
    return true;
  }

  if ((m & SENSOR_2_MIDDLE_MASK) &&
      (dir == MANUAL_DIR_FWD ||
       dir == MANUAL_DIR_FWD_LEFT ||
       dir == MANUAL_DIR_FWD_RIGHT)) {
    return false;
  }

  if ((m & SENSOR_1_RIGHT_MASK) &&
      (dir == MANUAL_DIR_RIGHT ||
       dir == MANUAL_DIR_FWD_RIGHT ||
       dir == MANUAL_DIR_BACK_RIGHT)) {
    return false;
  }

  if ((m & SENSOR_3_LEFT_MASK) &&
      (dir == MANUAL_DIR_LEFT ||
       dir == MANUAL_DIR_FWD_LEFT ||
       dir == MANUAL_DIR_BACK_LEFT)) {
    return false;
  }

