makarioussafa/Rovey_Mobile_Robot/Hardware_Codes/PID_ESP32_USB_SERIAL_ROS2_GUI_TCP_IMU_DIAG__copy_20260618051121.ino
  return true;
}

void sensorMaskCallback(const void * msgin) {
  const std_msgs__msg__UInt8 * msg = (const std_msgs__msg__UInt8 *)msgin;
  sensorMask = msg->data & 0x07;
  sensorReadOk++;
  rosSensorMaskRxCount++;
}

void decisionCallback(const void * msgin) {
  const std_msgs__msg__UInt8 * msg = (const std_msgs__msg__UInt8 *)msgin;
  uint8_t d = msg->data;
  if (d <= DECISION_OBSTACLE) {
    userDecision = d;
    rosDecisionRxCount++;
  }
}

void mechanismStateCallback(const void * msgin) {
  const std_msgs__msg__UInt8 * msg = (const std_msgs__msg__UInt8 *)msgin;
  uint8_t s = msg->data;
  if (s <= MECH_STATE_ERROR) {
    mechanismState = s;
    rosMechanismRxCount++;
  }
}

void pidControlCallback(const void * msgin) {
  const std_msgs__msg__UInt16 * msg = (const std_msgs__msg__UInt16 *)msgin;
  uint16_t packed = msg->data;
  uint8_t command = (uint8_t)((packed >> 12) & 0x0F);
  uint8_t dir = (uint8_t)((packed >> 8) & 0x0F);
  uint8_t value = (uint8_t)(packed & 0xFF);

  lastGuiCommand = command;
  lastGuiDirection = dir;
  lastGuiValue = value;
  lastGuiCommandMs = millis();
  cmdCount++;

  switch (command) {
    case PID_GUI_CMD_MODE:
      if (value <= GUI_MODE_AUTO) {
        guiMode = value;
        if (guiMode == GUI_MODE_MANUAL) {
          autoAbortRequested = true;
          pathAborted = true;
          manualDriveDir = MANUAL_DIR_STOP;
          manualDriveSpeed = 0;
        } else {
          autoAbortRequested = false;
        }
      }
      break;

    case PID_GUI_CMD_AUTO_START:
      if (guiMode == GUI_MODE_AUTO) {
        autoStartRequested = true;
        autoAbortRequested = false;
        pathAborted = false;
        pathFinished = false;
      }
      break;

    case PID_GUI_CMD_AUTO_ABORT:
      autoAbortRequested = true;
      autoStartRequested = false;
      pathAborted = true;
      manualDriveDir = MANUAL_DIR_STOP;
      manualDriveSpeed = 0;
      break;

    case PID_GUI_CMD_MANUAL_DRIVE:
      if (dir > MANUAL_DIR_ROT_R) dir = MANUAL_DIR_STOP;
      dir = remapManualDirectionForOperatorView(dir);
      if (value > 100) value = 100;
      if (dir != MANUAL_DIR_STOP && value < (uint8_t)MANUAL_SPEED_MIN_PERCENT) {
        value = (uint8_t)MANUAL_SPEED_MIN_PERCENT;
      }
      manualDriveDir = dir;
      manualDriveSpeed = (dir == MANUAL_DIR_STOP) ? 0 : value;
      lastManualDriveMs = millis();
      break;

    case PID_GUI_CMD_CAL_IMU:
      imuCalibrationRequested = true;
      break;

    case PID_GUI_CMD_RESET_ZERO:
      softwareResetZeroState();
      break;

    default:
      break;
  }
}

bool setupMicroRosNode() {
  set_microros_transports();
  delay(200);

  // Keep retrying until the Raspberry Pi micro-ROS serial agent is available.
  // This prevents the ESP32 from silently failing if it boots before the agent.
  while (rmw_uros_ping_agent(100, 1) != RMW_RET_OK) {
    delay(500);
  }

  ros_allocator = rcl_get_default_allocator();
  RCCHECK(rclc_support_init(&ros_support, 0, NULL, &ros_allocator));
  RCCHECK(rclc_node_init_default(&ros_node, "pid_path_node", "", &ros_support));

  RCCHECK(rclc_subscription_init_best_effort(
    &sensor_mask_sub,
    &ros_node,
    ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, UInt8),
    "/robot/sensors/mask"));

  RCCHECK(rclc_subscription_init_best_effort(
    &decision_sub,
    &ros_node,
    ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, UInt8),
    "/robot/sensors/decision"));

  RCCHECK(rclc_subscription_init_best_effort(
    &mechanism_state_sub,
    &ros_node,
    ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, UInt8),
    "/robot/mechanism/state"));

  RCCHECK(rclc_subscription_init_best_effort(
    &pid_control_sub,
    &ros_node,
    ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, UInt16),
    "/robot/cmd/pid_control"));

  RCCHECK(rclc_publisher_init_best_effort(
    &clear_decision_pub,
    &ros_node,
    ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, Bool),
    "/robot/cmd/clear_decision"));

  RCCHECK(rclc_publisher_init_best_effort(
    &arm_vision_pub,
    &ros_node,
    ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, Bool),
    "/robot/cmd/arm_vision"));

  RCCHECK(rclc_publisher_init_best_effort(
    &mechanism_cmd_pub,
    &ros_node,
    ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, UInt8),
    "/robot/cmd/mechanism"));

  RCCHECK(rclc_publisher_init_best_effort(
    &pid_obstacle_state_pub,
    &ros_node,
    ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, UInt8),
    "/robot/pid/obstacle_state"));

  RCCHECK(rclc_publisher_init_best_effort(
    &pid_path_step_pub,
    &ros_node,
    ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, UInt8),
    "/robot/pid/path_step"));

  RCCHECK(rclc_publisher_init_best_effort(
    &pid_path_flags_pub,
    &ros_node,
    ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, UInt8),
    "/robot/pid/path_flags"));

  RCCHECK(rclc_publisher_init_best_effort(
    &pid_static_mask_pub,
    &ros_node,
    ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, UInt8),
    "/robot/pid/static_mask"));

  RCCHECK(rclc_publisher_init_best_effort(
    &pid_imu_packet_pub,
    &ros_node,
    ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, Int32),
    "/robot/pid/imu_packet"));

  RCCHECK(rclc_publisher_init_best_effort(
    &pid_encoder_packet_pub,
    &ros_node,
    ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, Int32),
    "/robot/pid/encoder_packet"));

  RCCHECK(rclc_executor_init(&ros_executor, &ros_support.context, 4, &ros_allocator));
  RCCHECK(rclc_executor_add_subscription(&ros_executor, &sensor_mask_sub, &sensor_mask_msg, &sensorMaskCallback, ON_NEW_DATA));
  RCCHECK(rclc_executor_add_subscription(&ros_executor, &decision_sub, &decision_msg, &decisionCallback, ON_NEW_DATA));
  RCCHECK(rclc_executor_add_subscription(&ros_executor, &mechanism_state_sub, &mechanism_state_msg, &mechanismStateCallback, ON_NEW_DATA));
  RCCHECK(rclc_executor_add_subscription(&ros_executor, &pid_control_sub, &pid_control_msg, &pidControlCallback, ON_NEW_DATA));

  microRosReady = true;
  DebugSerial.println("micro-ROS PID/path node ready.");
  return true;
}

