makarioussafa/Rovey_Mobile_Robot/Hardware_Codes/PID_ESP32_USB_SERIAL_ROS2_GUI_TCP_IMU_DIAG__copy_20260618051121.ino
void enqueueRosCommand(uint8_t type, uint8_t value, uint8_t repeats) {
  if (!rosCommandQueue) {
    rosCommandQueueDropCount++;
    return;
  }

  RosCommand cmd;
  cmd.type = type;
  cmd.value = value;
  cmd.repeats = repeats;

  if (xQueueSendToBack(rosCommandQueue, &cmd, pdMS_TO_TICKS(20)) != pdTRUE) {
    rosCommandQueueDropCount++;
  }
}

void publishClearDecisionCommandFromMicroRosTask() {
  clear_decision_msg.data = true;
  RCSOFTCHECK(rcl_publish(&clear_decision_pub, &clear_decision_msg, NULL));
  rosClearTxCount++;
}

void publishArmVisionCommandFromMicroRosTask(bool arm) {
  arm_vision_msg.data = arm;

  RCSOFTCHECK(rcl_publish(&arm_vision_pub, &arm_vision_msg, NULL));
  rosArmTxCount++;
}

void publishMechanismCommandFromMicroRosTask(uint8_t cmd) {
  mechanism_cmd_msg.data = cmd;

  RCSOFTCHECK(rcl_publish(&mechanism_cmd_pub, &mechanism_cmd_msg, NULL));
  rosMechanismCmdTxCount++;
}

int32_t makeImuPacket(int32_t field, int32_t value) {
  if (value < -49999L) value = -49999L;
  if (value >  49999L) value =  49999L;
  return (field * IMU_PACKET_SCALE) + (value + IMU_PACKET_OFFSET);
}

void publishImuPacketFromMicroRosTask(int32_t field, int32_t value) {
  pid_imu_packet_msg.data = makeImuPacket(field, value);
  RCSOFTCHECK(rcl_publish(&pid_imu_packet_pub, &pid_imu_packet_msg, NULL));
}

int32_t makeEncoderPacket(int32_t field, int32_t value) {
  if (value < -499999L) value = -499999L;
  if (value >  499999L) value =  499999L;
  return (field * ENCODER_PACKET_SCALE) + (value + ENCODER_PACKET_OFFSET);
}

void publishEncoderPacketFromMicroRosTask(int32_t field, int32_t value) {
  pid_encoder_packet_msg.data = makeEncoderPacket(field, value);
  RCSOFTCHECK(rcl_publish(&pid_encoder_packet_pub, &pid_encoder_packet_msg, NULL));
}

bool isImuLiveNow() {
  if (!imuReady || imuCalibrating) return false;
  return (uint32_t)(millis() - lastImuOkMs) <= IMU_LIVE_TIMEOUT_MS;
}

int32_t wheelPercentFromRadS(float radS) {
  float pct = (radS / MAX_RAD_S) * 100.0f;
  if (pct < -100.0f) pct = -100.0f;
  if (pct >  100.0f) pct =  100.0f;
  return (int32_t)pct;
}

void publishWheelTelemetryFromMicroRosTask() {
  float fl = measuredRad[W_FL];
  float fr = measuredRad[W_FR];
  float bl = measuredRad[W_BL];
  float br = measuredRad[W_BR];
  float avg = (fabsf(fl) + fabsf(fr) + fabsf(bl) + fabsf(br)) * 25.0f / MAX_RAD_S;
  if (avg > 100.0f) avg = 100.0f;

  publishImuPacketFromMicroRosTask(PID_FIELD_WHEEL_FL_PCT, wheelPercentFromRadS(fl));
  publishImuPacketFromMicroRosTask(PID_FIELD_WHEEL_FR_PCT, wheelPercentFromRadS(fr));
  publishImuPacketFromMicroRosTask(PID_FIELD_WHEEL_BL_PCT, wheelPercentFromRadS(bl));
  publishImuPacketFromMicroRosTask(PID_FIELD_WHEEL_BR_PCT, wheelPercentFromRadS(br));
  publishImuPacketFromMicroRosTask(PID_FIELD_WHEEL_AVG_PCT, (int32_t)avg);
}

void publishEncoderTelemetryFromMicroRosTask() {
  static int32_t previousTicks[4] = {0, 0, 0, 0};
  static bool havePreviousTicks = false;
  static uint32_t seenEncoderResetGeneration = 0;

  int32_t snap[4];
  int32_t delta[4] = {0, 0, 0, 0};
  readTicks(snap);

  uint32_t resetGenerationNow = encoderResetGeneration;
  if (!havePreviousTicks || seenEncoderResetGeneration != resetGenerationNow) {
    havePreviousTicks = true;
    seenEncoderResetGeneration = resetGenerationNow;
  } else {
    for (int i = 0; i < 4; i++) {
      delta[i] = snap[i] - previousTicks[i];
    }
  }

  for (int i = 0; i < 4; i++) {
    previousTicks[i] = snap[i];
  }

  uint8_t flags = 0;
  if (pathRunning)  flags |= 0x01;
  if (pathFinished) flags |= 0x02;
  if (pathAborted)  flags |= 0x04;

  uint32_t nowMs = millis();
  uint32_t commandAgeMs = (lastGuiCommandMs == 0) ? 499999u : (uint32_t)(nowMs - lastGuiCommandMs);
  if (commandAgeMs > 499999u) commandAgeMs = 499999u;

  publishEncoderPacketFromMicroRosTask(ENC_FIELD_TICKS_FL, snap[W_FL]);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_TICKS_FR, snap[W_FR]);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_TICKS_BL, snap[W_BL]);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_TICKS_BR, snap[W_BR]);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_DELTA_FL, delta[W_FL]);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_DELTA_FR, delta[W_FR]);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_DELTA_BL, delta[W_BL]);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_DELTA_BR, delta[W_BR]);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_FORWARD_MM, (int32_t)lroundf(getForwardEncoderDistanceM() * 1000.0f));
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_LATERAL_MM, (int32_t)lroundf(getLateralEncoderDistanceM() * 1000.0f));
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_ODOM_X_MM, (int32_t)lroundf(odomX * 1000.0f));
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_ODOM_Y_MM, (int32_t)lroundf(odomY * 1000.0f));
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_ROBOT_MODE, (int32_t)robotMode);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_GUI_MODE, (int32_t)guiMode);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_MANUAL_DIR, (int32_t)manualDriveDir);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_MANUAL_SPEED, (int32_t)manualDriveSpeed);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_LAST_GUI_COMMAND, (int32_t)lastGuiCommand);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_LAST_GUI_DIRECTION, (int32_t)lastGuiDirection);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_LAST_GUI_VALUE, (int32_t)lastGuiValue);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_LAST_GUI_AGE_MS, (int32_t)commandAgeMs);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_PATH_STEP, (int32_t)currentPathStep);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_OBSTACLE_STATE, (int32_t)obstacleState);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_PATH_FLAGS, (int32_t)flags);
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_SEGMENT_DONE_MM, (int32_t)lroundf(currentSegmentDoneM * 1000.0f));
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_SEGMENT_REMAIN_MM, (int32_t)lroundf(currentSegmentRemainingM * 1000.0f));
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_TARGET_VX_MMS, (int32_t)lroundf(targVx * 1000.0f));
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_TARGET_VY_MMS, (int32_t)lroundf(targVy * 1000.0f));
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_TARGET_WZ_MRADS, (int32_t)lroundf(targWz * 1000.0f));
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_PROFILE_VX_MMS, (int32_t)lroundf(profVx * 1000.0f));
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_PROFILE_VY_MMS, (int32_t)lroundf(profVy * 1000.0f));
  publishEncoderPacketFromMicroRosTask(ENC_FIELD_PROFILE_WZ_MRADS, (int32_t)lroundf(profWz * 1000.0f));
}

