makarioussafa/Rovey_Mobile_Robot/Hardware_Codes/PID_ESP32_USB_SERIAL_ROS2_GUI_TCP_IMU_DIAG__copy_20260618051121.ino
void publishPidStatusFromMicroRosTask() {
  uint8_t flags = 0;
  if (pathRunning)  flags |= 0x01;
  if (pathFinished) flags |= 0x02;
  if (pathAborted)  flags |= 0x04;

  pid_obstacle_state_msg.data = obstacleState;
  pid_path_step_msg.data = (uint8_t)constrain(currentPathStep, 0, 255);
  pid_path_flags_msg.data = flags;
  pid_static_mask_msg.data = lastStaticObstacleMask & 0x07;

  RCSOFTCHECK(rcl_publish(&pid_obstacle_state_pub, &pid_obstacle_state_msg, NULL));
  RCSOFTCHECK(rcl_publish(&pid_path_step_pub, &pid_path_step_msg, NULL));
  RCSOFTCHECK(rcl_publish(&pid_path_flags_pub, &pid_path_flags_msg, NULL));
  RCSOFTCHECK(rcl_publish(&pid_static_mask_pub, &pid_static_mask_msg, NULL));

  publishImuPacketFromMicroRosTask(IMU_FIELD_STATUS, isImuLiveNow() ? 1L : 0L);
  publishImuPacketFromMicroRosTask(IMU_FIELD_YAW_CDEG,   (int32_t)(imuYawDeg * 100.0f));
  publishImuPacketFromMicroRosTask(IMU_FIELD_PITCH_CDEG, (int32_t)(imuPitchDeg * 100.0f));
  publishImuPacketFromMicroRosTask(IMU_FIELD_ROLL_CDEG,  (int32_t)(imuRollDeg * 100.0f));
  publishImuPacketFromMicroRosTask(IMU_FIELD_TEMP_D10,   (int32_t)imuTempD10);
  publishWheelTelemetryFromMicroRosTask();

  uint32_t lastOkAgeMs = (lastImuOkMs == 0) ? 49999u : (uint32_t)(millis() - lastImuOkMs);
  if (lastOkAgeMs > 49999u) lastOkAgeMs = 49999u;

  publishImuPacketFromMicroRosTask(IMU_FIELD_WHO_AM_I, (int32_t)imuWhoAmI);
  publishImuPacketFromMicroRosTask(IMU_FIELD_READ_OK_MOD, (int32_t)(imuReadOkCount % 50000u));
  publishImuPacketFromMicroRosTask(IMU_FIELD_READ_FAIL_MOD, (int32_t)(imuReadFailCount % 50000u));
  publishImuPacketFromMicroRosTask(IMU_FIELD_CAL_VALID, (int32_t)imuCalibrationValidSamples);
  publishImuPacketFromMicroRosTask(IMU_FIELD_LAST_OK_AGE_MS, (int32_t)lastOkAgeMs);
  publishImuPacketFromMicroRosTask(IMU_FIELD_INIT_OK, imuInitOk ? 1L : 0L);
  publishImuPacketFromMicroRosTask(IMU_FIELD_RAW_AX, (int32_t)imuRawAx);
  publishImuPacketFromMicroRosTask(IMU_FIELD_RAW_AY, (int32_t)imuRawAy);
  publishImuPacketFromMicroRosTask(IMU_FIELD_RAW_AZ, (int32_t)imuRawAz);
  publishImuPacketFromMicroRosTask(IMU_FIELD_RAW_GX, (int32_t)imuRawGx);
  publishImuPacketFromMicroRosTask(IMU_FIELD_RAW_GY, (int32_t)imuRawGy);
  publishImuPacketFromMicroRosTask(IMU_FIELD_RAW_GZ, (int32_t)imuRawGz);
  publishImuPacketFromMicroRosTask(IMU_FIELD_READ_INVALID_MOD, (int32_t)(imuReadInvalidCount % 50000u));
  publishEncoderTelemetryFromMicroRosTask();
  rosPidStatusTxCount++;
}

void publishClearDecisionCommand() {
  // Request only. The micro-ROS task owns the serial transport and does the real publish.
  enqueueRosCommand(ROS_CMD_CLEAR_DECISION, true, CLEAR_DECISION_BURST_COUNT);
}

void publishArmVisionCommand(bool arm) {
  // Request only. The micro-ROS task publishes /robot/cmd/arm_vision.
  // The Sensor/Mechanism ESP republishes /vision/arm for the Pi vision node.
  enqueueRosCommand(ROS_CMD_ARM_VISION, arm, ARM_VISION_BURST_COUNT);
}

void publishMechanismRunCommand() {
  // Request only. The micro-ROS task publishes /robot/cmd/mechanism = MECH_CMD_RUN.
  enqueueRosCommand(ROS_CMD_MECHANISM, MECH_CMD_RUN, MECHANISM_CMD_BURST_COUNT);
}

void taskMicroRos(void* pv) {
  TickType_t t = xTaskGetTickCount();
  RosCommand activeCmd;
  bool hasActiveCmd = false;
  uint32_t lastCommandPublishMs = 0;
  uint32_t lastPidStatusPublishMs = 0;

  while (true) {
    if (microRosReady) {
      // Keep every micro-ROS operation in this one task. USB serial micro-ROS is
      // fragile when one task spins while another task publishes.
      RCSOFTCHECK(rclc_executor_spin_some(&ros_executor, RCL_MS_TO_NS(2)));

      uint32_t nowMs = millis();

      if (!hasActiveCmd && rosCommandQueue) {
        if (xQueueReceive(rosCommandQueue, &activeCmd, 0) == pdTRUE) {
          hasActiveCmd = true;
          lastCommandPublishMs = 0;
        }
      }

      if (hasActiveCmd &&
          activeCmd.repeats > 0 &&
          (lastCommandPublishMs == 0 ||
           (uint32_t)(nowMs - lastCommandPublishMs) >= ROS_CMD_BURST_INTERVAL_MS)) {
        lastCommandPublishMs = nowMs;

        if (activeCmd.type == ROS_CMD_CLEAR_DECISION) {
          publishClearDecisionCommandFromMicroRosTask();
        } else if (activeCmd.type == ROS_CMD_ARM_VISION) {
          publishArmVisionCommandFromMicroRosTask(activeCmd.value != 0);
        } else if (activeCmd.type == ROS_CMD_MECHANISM) {
          publishMechanismCommandFromMicroRosTask(activeCmd.value);
        }

        activeCmd.repeats--;
        if (activeCmd.repeats == 0) {
          hasActiveCmd = false;
        }
      }

      if ((uint32_t)(nowMs - lastPidStatusPublishMs) >= ROS_PID_STATUS_PERIOD_MS) {
        lastPidStatusPublishMs = nowMs;
        publishPidStatusFromMicroRosTask();
      }
    }
    vTaskDelayUntil(&t, pdMS_TO_TICKS(2));
  }
}

// =====================================================
// Utility Functions
// =====================================================
float clampFloat(float v, float lo, float hi) {
  if (v < lo) return lo;
  if (v > hi) return hi;
  return v;
}

float signFloat(float v) {
  if (v > 0.0f) return  1.0f;
  if (v < 0.0f) return -1.0f;
  return 0.0f;
}

float wrapAngle180(float a) {
  while (a >  180.0f) a -= 360.0f;
  while (a < -180.0f) a += 360.0f;
  return a;
}

float angleDiffDeg(float target, float current) {
  return wrapAngle180(target - current);
}

float stepToward(float current, float target, float maxStep) {
  float err = target - current;
  if (err >  maxStep) return current + maxStep;
  if (err < -maxStep) return current - maxStep;
  return target;
}

float crossTrackCorrectionMps(float errorM) {
  if (fabsf(errorM) < CROSSTRACK_DEADBAND_M) {
    return 0.0f;
  }
  return clampFloat(KP_CROSSTRACK * errorM,
                    -MAX_CROSSTRACK_CORR_MPS,
                    MAX_CROSSTRACK_CORR_MPS);
}

// =====================================================
// Encoder ISRs
// =====================================================
void IRAM_ATTR isr_fl_a() {
  int a = gpio_get_level((gpio_num_t)FL_A);
  int b = gpio_get_level((gpio_num_t)FL_B);
  portENTER_CRITICAL_ISR(&encMux);
  ticks[W_FL] += (a != b) ? 1 : -1;
  portEXIT_CRITICAL_ISR(&encMux);
}
void IRAM_ATTR isr_fl_b() {
  int a = gpio_get_level((gpio_num_t)FL_A);
  int b = gpio_get_level((gpio_num_t)FL_B);
  portENTER_CRITICAL_ISR(&encMux);
  ticks[W_FL] += (a == b) ? 1 : -1;
  portEXIT_CRITICAL_ISR(&encMux);
}
void IRAM_ATTR isr_fr_a() {
  int a = gpio_get_level((gpio_num_t)FR_A);
  int b = gpio_get_level((gpio_num_t)FR_B);
  portENTER_CRITICAL_ISR(&encMux);
  ticks[W_FR] += (a != b) ? 1 : -1;
  portEXIT_CRITICAL_ISR(&encMux);
}
void IRAM_ATTR isr_fr_b() {
  int a = gpio_get_level((gpio_num_t)FR_A);
  int b = gpio_get_level((gpio_num_t)FR_B);
  portENTER_CRITICAL_ISR(&encMux);
  ticks[W_FR] += (a == b) ? 1 : -1;
  portEXIT_CRITICAL_ISR(&encMux);
}
void IRAM_ATTR isr_bl_a() {
  int a = gpio_get_level((gpio_num_t)BL_A);
  int b = gpio_get_level((gpio_num_t)BL_B);
  portENTER_CRITICAL_ISR(&encMux);
  ticks[W_BL] += (a != b) ? 1 : -1;
  portEXIT_CRITICAL_ISR(&encMux);
}
void IRAM_ATTR isr_bl_b() {
  int a = gpio_get_level((gpio_num_t)BL_A);
  int b = gpio_get_level((gpio_num_t)BL_B);
  portENTER_CRITICAL_ISR(&encMux);
  ticks[W_BL] += (a == b) ? 1 : -1;
  portEXIT_CRITICAL_ISR(&encMux);
}
void IRAM_ATTR isr_br_a() {
  int a = gpio_get_level((gpio_num_t)BR_A);
  int b = gpio_get_level((gpio_num_t)BR_B);
  portENTER_CRITICAL_ISR(&encMux);
  ticks[W_BR] += (a != b) ? 1 : -1;
  portEXIT_CRITICAL_ISR(&encMux);
}
void IRAM_ATTR isr_br_b() {
  int a = gpio_get_level((gpio_num_t)BR_A);
  int b = gpio_get_level((gpio_num_t)BR_B);
  portENTER_CRITICAL_ISR(&encMux);
  ticks[W_BR] += (a == b) ? 1 : -1;
  portEXIT_CRITICAL_ISR(&encMux);
}

