makarioussafa/Rovey_Mobile_Robot/Hardware_Codes/PID_ESP32_USB_SERIAL_ROS2_GUI_TCP_IMU_DIAG__copy_20260618051121.ino
void readTicks(int32_t snap[4]) {
  portENTER_CRITICAL(&encMux);
  snap[W_FL] = (int32_t)ENCODER_SIGN[W_FL] * ticks[W_FL];
  snap[W_FR] = (int32_t)ENCODER_SIGN[W_FR] * ticks[W_FR];
  snap[W_BL] = (int32_t)ENCODER_SIGN[W_BL] * ticks[W_BL];
  snap[W_BR] = (int32_t)ENCODER_SIGN[W_BR] * ticks[W_BR];
  portEXIT_CRITICAL(&encMux);
}

void resetTicks() {
  portENTER_CRITICAL(&encMux);
  ticks[W_FL]=0; ticks[W_FR]=0; ticks[W_BL]=0; ticks[W_BR]=0;
  encoderResetGeneration++;
  portEXIT_CRITICAL(&encMux);
}

// =====================================================
// Encoder Distance Helpers
// =====================================================
float ticksToRad(int32_t t, uint8_t wheel) {
  return ((float)t / CPR[wheel]) * 2.0f * PI;
}

float getForwardEncoderDistanceM() {
  int32_t snap[4]; readTicks(snap);
  float w0 = ticksToRad(snap[W_FL], W_FL);
  float w1 = ticksToRad(snap[W_FR], W_FR);
  float w2 = ticksToRad(snap[W_BL], W_BL);
  float w3 = ticksToRad(snap[W_BR], W_BR);
  return (WHEEL_R / 4.0f) * (w0 + w1 + w2 + w3);
}

float getLateralEncoderDistanceM() {
  int32_t snap[4]; readTicks(snap);
  float w0 = ticksToRad(snap[W_FL], W_FL);
  float w1 = ticksToRad(snap[W_FR], W_FR);
  float w2 = ticksToRad(snap[W_BL], W_BL);
  float w3 = ticksToRad(snap[W_BR], W_BR);
  return (WHEEL_R / 4.0f) * (-w0 + w1 + w2 - w3);   // positive = strafe left
}

// =====================================================
// PWM Compatibility (Arduino core v2 and v3)
// =====================================================
void setupPwmPin(uint8_t pin, uint8_t channel) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(pin, PWM_FREQ, PWM_RES_BITS);
#else
  ledcSetup(channel, PWM_FREQ, PWM_RES_BITS);
  ledcAttachPin(pin, channel);
#endif
}

void writePwm(uint8_t pin, uint8_t channel, int duty) {
  duty = constrain(duty, 0, PWM_MAX);
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(pin, duty);
#else
  ledcWrite(channel, duty);
#endif
}

bool manualTurnCommandActive();
bool lateralStrafeCommandActive();
bool rearOpposedAssistActive(uint8_t i);
void resetWheelRecovery(uint8_t i);
void updateWheelResponseRecovery(uint8_t i, float sp, float meas);
int16_t applyWheelRecoveryAssist(uint8_t i, int16_t pidPwm, float sp);

// =====================================================
// Motor Driver
// =====================================================
void motorWrite(uint8_t i, int16_t pwm) {
  pwm = constrain(pwm, -255, 255);
  if (abs(pwm) < 2) {
    digitalWrite(MOT[i].dn1, LOW); digitalWrite(MOT[i].dn2, LOW);
    writePwm(MOT[i].pwm, MOT[i].ch, 0);
    motorPwmOut[i] = 0;
    return;
  }
  int16_t drivePwm = constrain((int16_t)(pwm * MOTOR_SIGN[i]), -255, 255);
  uint8_t minPwm = PWM_MIN;
  RobotMode modeSnapshot = robotMode;
  if (modeSnapshot == MODE_TURN_ANGLE || manualTurnCommandActive()) {
    minPwm = PWM_MIN_TURN;
  } else if (lateralStrafeCommandActive()) {
    minPwm = PWM_MIN_LATERAL;
  } else if (modeSnapshot == MODE_MOVE_DISTANCE || modeSnapshot == MODE_STRAFE_DISTANCE) {
    minPwm = PWM_MIN_MOVE;
  }
  if (rearOpposedAssistActive(i) && minPwm < PWM_MIN_REAR_OPPOSED) {
    minPwm = PWM_MIN_REAR_OPPOSED;
  }
  uint8_t mag = (uint8_t)(minPwm + (abs(drivePwm) * (PWM_MAX - minPwm)) / 255);
  if (drivePwm > 0) { digitalWrite(MOT[i].dn1, HIGH); digitalWrite(MOT[i].dn2, LOW); }
  else              { digitalWrite(MOT[i].dn1, LOW);  digitalWrite(MOT[i].dn2, HIGH); }
  writePwm(MOT[i].pwm, MOT[i].ch, mag);
  motorPwmOut[i] = pwm;
}

void stopAllMotors() {
  for (int i = 0; i < 4; i++) motorWrite(i, 0);
}

// =====================================================
// PID Functions
// =====================================================
void resetPid(uint8_t i) { pid[i].integral = 0.0f; pid[i].prevErr = 0.0f; }
void resetAllPid()        { for (int i = 0; i < 4; i++) resetPid(i); }

bool manualTurnCommandActive() {
  return robotMode == MODE_IDLE &&
         guiMode == GUI_MODE_MANUAL &&
         manualDriveSpeed > 0 &&
         (manualDriveDir == MANUAL_DIR_ROT_L || manualDriveDir == MANUAL_DIR_ROT_R);
}

bool lateralStrafeCommandActive() {
  RobotMode modeSnapshot = robotMode;
  if (modeSnapshot == MODE_STRAFE_DISTANCE) return true;

  if (modeSnapshot != MODE_IDLE ||
      guiMode != GUI_MODE_MANUAL ||
      manualDriveSpeed == 0) {
    return false;
  }

  return manualDriveDir == MANUAL_DIR_LEFT ||
         manualDriveDir == MANUAL_DIR_RIGHT ||
         manualDriveDir == MANUAL_DIR_FWD_LEFT ||
         manualDriveDir == MANUAL_DIR_FWD_RIGHT ||
         manualDriveDir == MANUAL_DIR_BACK_LEFT ||
         manualDriveDir == MANUAL_DIR_BACK_RIGHT;
}

bool rearOpposedAssistActive(uint8_t i) {
  if (i != W_BL && i != W_BR) return false;
  float bl = setpointRad[W_BL];
  float br = setpointRad[W_BR];
  if (fabsf(bl) < WHEEL_RESPONSE_SETPOINT_RAD_S ||
      fabsf(br) < WHEEL_RESPONSE_SETPOINT_RAD_S) {
    return false;
  }
  return signFloat(bl) != signFloat(br);
}

void resetWheelRecovery(uint8_t i) {
  wheelBadResponseStartMs[i] = 0;
  wheelLastRecoveryStepMs[i] = 0;
  wheelRecoveryBoostPwm[i] = 0;
}

void updateWheelResponseRecovery(uint8_t i, float sp, float meas) {
  float absSp = fabsf(sp);
  if (absSp < WHEEL_RESPONSE_SETPOINT_RAD_S) {
    resetWheelRecovery(i);
    return;
  }

  float absMeas = fabsf(meas);
  float ratio = absMeas / absSp;
  bool wrongDirection =
    absMeas > WHEEL_WRONG_DIR_RAD_S && signFloat(meas) != signFloat(sp);
  bool weakResponse = ratio < WHEEL_RESPONSE_MIN_RATIO;
  uint32_t nowMs = millis();

  if (wrongDirection || weakResponse) {
    if (wheelBadResponseStartMs[i] == 0) {
      wheelBadResponseStartMs[i] = nowMs;
      wheelLastRecoveryStepMs[i] = 0;
    }

    if ((uint32_t)(nowMs - wheelBadResponseStartMs[i]) >= WHEEL_STALL_TIME_MS &&
        (wheelLastRecoveryStepMs[i] == 0 ||
         (uint32_t)(nowMs - wheelLastRecoveryStepMs[i]) >= WHEEL_RECOVERY_STEP_PERIOD_MS)) {
      int16_t step = wrongDirection ? (WHEEL_RECOVERY_STEP_PWM * 2) : WHEEL_RECOVERY_STEP_PWM;
      int16_t nextBoost = wheelRecoveryBoostPwm[i] + step;
      if (nextBoost > WHEEL_RECOVERY_MAX_PWM) nextBoost = WHEEL_RECOVERY_MAX_PWM;
      wheelRecoveryBoostPwm[i] = nextBoost;
      wheelLastRecoveryStepMs[i] = nowMs;
      if (wrongDirection) resetPid(i);
    }
    return;
  }

  wheelBadResponseStartMs[i] = 0;
  wheelLastRecoveryStepMs[i] = 0;
  if (ratio > WHEEL_RESPONSE_RELEASE_RATIO && wheelRecoveryBoostPwm[i] > 0) {
    int16_t nextBoost = wheelRecoveryBoostPwm[i] - WHEEL_RECOVERY_DECAY_PWM;
    wheelRecoveryBoostPwm[i] = (nextBoost > 0) ? nextBoost : 0;
  }
}

int16_t applyWheelRecoveryAssist(uint8_t i, int16_t pidPwm, float sp) {
  float commandSign = signFloat(sp);
  if (commandSign == 0.0f) return pidPwm;

  float ffPwm = commandSign * WHEEL_FF_GAIN * (fabsf(sp) / MAX_RAD_S) * 255.0f;
  int16_t assistPwm = wheelRecoveryBoostPwm[i];
  if (rearOpposedAssistActive(i)) {
    assistPwm += REAR_OPPOSED_ASSIST_PWM;
  }

