makarioussafa/Rovey_Mobile_Robot/Hardware_Codes/PID_ESP32_USB_SERIAL_ROS2_GUI_TCP_IMU_DIAG__copy_20260618051121.ino
  float out = (float)pidPwm + ffPwm;
  if (assistPwm > 0) {
    float assistSigned = commandSign * (float)assistPwm;
    if (wheelRecoveryBoostPwm[i] > 0 &&
        signFloat(out) == -commandSign &&
        fabsf(out) > 20.0f) {
      out = assistSigned;
    } else {
      out += assistSigned;
    }
  }

  return (int16_t)clampFloat(out, -255.0f, 255.0f);
}

float pidCompute(uint8_t i, float sp, float meas) {
  float err = sp - meas;
  pid[i].integral += err * PID_DT;
  pid[i].integral  = clampFloat(pid[i].integral,
                                -pid[i].integralLimit, pid[i].integralLimit);
  float deriv    = (err - pid[i].prevErr) / PID_DT;
  pid[i].prevErr = err;
  float out = (pid[i].kp * err) + (pid[i].ki * pid[i].integral) + (pid[i].kd * deriv);
  return clampFloat(out, pid[i].outMin, pid[i].outMax);
}

// =====================================================
// Mecanum IK
// =====================================================
void mecanumIK(float Vx, float Vy, float Wz) {
  float r = 1.0f / WHEEL_R;
  setpointRad[W_FL] = r * (Vx - Vy - ROBOT_LW * Wz);
  setpointRad[W_FR] = r * (Vx + Vy + ROBOT_LW * Wz);
  setpointRad[W_BL] = r * (Vx + Vy - ROBOT_LW * Wz);
  setpointRad[W_BR] = r * (Vx - Vy + ROBOT_LW * Wz);
  float peak = 0.001f;
  for (int i = 0; i < 4; i++) if (fabsf(setpointRad[i]) > peak) peak = fabsf(setpointRad[i]);
  if (peak > MAX_RAD_S) {
    float scale = MAX_RAD_S / peak;
    for (int i = 0; i < 4; i++) setpointRad[i] *= scale;
  }
}

void setSetpointsZero() { for (int i = 0; i < 4; i++) setpointRad[i] = 0.0f; }

// =====================================================
// IMU Low-Level
// =====================================================
bool mpuWrite(uint8_t reg, uint8_t value) {
  bool ok = false;
  if (i2cMutex) xSemaphoreTake(i2cMutex, portMAX_DELAY);
  Wire.beginTransmission(MPU_ADDR);
  Wire.write(reg); Wire.write(value);
  ok = (Wire.endTransmission() == 0);
  if (i2cMutex) xSemaphoreGive(i2cMutex);
  return ok;
}

bool mpuReadRegister(uint8_t reg, uint8_t &value) {
  bool ok = false;
  if (i2cMutex) xSemaphoreTake(i2cMutex, portMAX_DELAY);
  Wire.beginTransmission(MPU_ADDR);
  Wire.write(reg);
  if (Wire.endTransmission(false) == 0) {
    if (Wire.requestFrom((uint8_t)MPU_ADDR, (uint8_t)1) == 1) {
      value = Wire.read();
      ok = true;
    }
  }
  while (Wire.available()) Wire.read();
  if (i2cMutex) xSemaphoreGive(i2cMutex);
  return ok;
}

bool readWhoAmIWithRetry(uint8_t &whoOut) {
  whoOut = 0;
  for (uint8_t attempt = 0; attempt < 10; attempt++) {
    uint8_t who = 0;
    if (mpuReadRegister(MPU_REG_WHO_AM_I, who)) {
      whoOut = who;
      if (who == 0x68) return true;
    }
    delay(20);
  }
  return false;
}

bool mpuReadBytes(uint8_t reg, uint8_t *buf, uint8_t len) {
  bool ok = false;
  if (i2cMutex) xSemaphoreTake(i2cMutex, portMAX_DELAY);
  Wire.beginTransmission(MPU_ADDR);
  Wire.write(reg);
  if (Wire.endTransmission(false) == 0) {
    uint8_t received = Wire.requestFrom((uint8_t)MPU_ADDR, len);
    if (received == len) {
      for (uint8_t i = 0; i < len; i++) buf[i] = Wire.read();
      ok = true;
    }
  }
  while (Wire.available()) Wire.read();
  if (i2cMutex) xSemaphoreGive(i2cMutex);
  return ok;
}

bool imuRawSampleLooksAlive(int16_t axRaw, int16_t ayRaw, int16_t azRaw) {
  uint32_t axAbs = (uint32_t)((axRaw < 0) ? -(long)axRaw : (long)axRaw);
  uint32_t ayAbs = (uint32_t)((ayRaw < 0) ? -(long)ayRaw : (long)ayRaw);
  uint32_t azAbs = (uint32_t)((azRaw < 0) ? -(long)azRaw : (long)azRaw);
  return (axAbs + ayAbs + azAbs) > 4000u;
}

bool readMPURaw(int16_t &axRaw, int16_t &ayRaw, int16_t &azRaw,
                int16_t &tempRaw,
                int16_t &gxRaw, int16_t &gyRaw, int16_t &gzRaw) {
  uint8_t data[14];
  if (!mpuReadBytes(MPU_REG_ACCEL_XOUT_H, data, 14)) return false;
  axRaw = (int16_t)((data[0]  << 8) | data[1]);
  ayRaw = (int16_t)((data[2]  << 8) | data[3]);
  azRaw = (int16_t)((data[4]  << 8) | data[5]);
  tempRaw = (int16_t)((data[6] << 8) | data[7]);
  gxRaw = (int16_t)((data[8]  << 8) | data[9]);
  gyRaw = (int16_t)((data[10] << 8) | data[11]);
  gzRaw = (int16_t)((data[12] << 8) | data[13]);
  imuRawAx = axRaw;
  imuRawAy = ayRaw;
  imuRawAz = azRaw;
  imuRawGx = gxRaw;
  imuRawGy = gyRaw;
  imuRawGz = gzRaw;
  imuTempD10 = (int16_t)roundf((((float)tempRaw / 340.0f) + 36.53f) * 10.0f);
  return true;
}

bool initMPU() {
  delay(100);
  bool ok = true;
  uint8_t whoBefore = 0;

  imuReady = false;
  imuInitOk = false;
  imuWhoAmI = 0;

  if (!readWhoAmIWithRetry(whoBefore)) {
    imuWhoAmI = whoBefore;
    return false;
  }
  imuWhoAmI = whoBefore;

  ok &= mpuWrite(MPU_REG_PWR_MGMT_1, 0x80); delay(100);  // hardware reset
  ok &= mpuWrite(MPU_REG_PWR_MGMT_1, 0x01); delay(100);  // wake, X gyro PLL clock
  ok &= mpuWrite(MPU_REG_SMPLRT_DIV, 9);                 // 100 Hz sample rate with DLPF
  ok &= mpuWrite(MPU_REG_CONFIG, 0x03);                   // DLPF_CFG=3
  ok &= mpuWrite(MPU_REG_GYRO_CONFIG, 0x00);              // +/-250 dps
  ok &= mpuWrite(MPU_REG_ACCEL_CONFIG, 0x00);             // +/-2g

  uint8_t whoAfter = 0;
  bool whoAfterOk = readWhoAmIWithRetry(whoAfter);
  imuWhoAmI = whoAfter;

  imuInitOk = ok && whoAfterOk && (whoAfter == 0x68);
  return imuInitOk;
}

void stopRobotHard() {
  robotMode = MODE_IDLE;
  targVx=0; targVy=0; targWz=0;
  profVx=0; profVy=0; profWz=0;
  moveYawIntegralRad = 0.0f;
  turnStallStartMs = 0;
  turnStallBoostActive = false;
  setSetpointsZero();
  resetAllPid();
  stopAllMotors();
}

void calibrateMPU(uint16_t samples) {
  imuCalibrating = true; imuReady = false;
  imuCalibrationTotalSamples = samples;
  imuCalibrationValidSamples = 0;
  lastImuOkMs = 0;
  stopRobotHard();
  if (!imuInitOk) {
    DebugSerial.println("IMU calibration requested while MPU init is invalid. Retrying init.");
    if (!initMPU()) {
      imuCalibrating = false;
      DebugSerial.println("IMU calibration refused: MPU initialization is not valid.");
      return;
    }
  }
  uint8_t who = 0;
  if (!readWhoAmIWithRetry(who)) {
    imuWhoAmI = who;
    imuInitOk = false;
    imuCalibrating = false;
    DebugSerial.println("IMU calibration refused: WHO_AM_I is not 0x68.");
    return;
  }
  imuWhoAmI = who;
  DebugSerial.println("IMU calibration started. Keep robot still.");
  double axSum=0,aySum=0,azSum=0,gxSum=0,gySum=0,gzSum=0;
  uint16_t valid=0;
  delay(2000);
  for (uint16_t i=0; i<samples; i++) {
    int16_t axR,ayR,azR,tempR,gxR,gyR,gzR;
    if (readMPURaw(axR,ayR,azR,tempR,gxR,gyR,gzR)) {
      if (imuRawSampleLooksAlive(axR, ayR, azR)) {
        axSum+=axR; aySum+=ayR; azSum+=azR;
        gxSum+=gxR; gySum+=gyR; gzSum+=gzR;
        valid++;
      } else {
        imuReadInvalidCount++;
      }
    } else {
      imuReadFailCount++;
      lastImuFailMs = millis();
    }
    delay(2);
  }
  imuCalibrationValidSamples = valid;
  uint16_t minValid = (uint16_t)((uint32_t)samples * 9u / 10u);
  if (imuInitOk && valid >= minValid) {
    axOffset=(float)(axSum/valid)/ACC_SENS;
    ayOffset=(float)(aySum/valid)/ACC_SENS;
    azOffset=(float)(azSum/valid)/ACC_SENS-1.0f;
    gxOffset=(float)(gxSum/valid)/GYRO_SENS;
    gyOffset=(float)(gySum/valid)/GYRO_SENS;
    gzOffset=(float)(gzSum/valid)/GYRO_SENS;
    imuRollDeg=0; imuPitchDeg=0; imuYawDeg=0;
    gyroXDegS=0; gyroYDegS=0; gyroZDegS=0;
    accXf=0; accYf=0; accZf=1; gyroZf=0;
    lastImuMicros=micros();
    lastImuOkMs=millis();
    imuReady=true;
    DebugSerial.println("IMU calibration done.");
    DebugSerial.printf("Gyro offsets deg/s: %.6f %.6f %.6f\n",gxOffset,gyOffset,gzOffset);
  } else {
    imuReady=false;
    DebugSerial.println("IMU calibration FAILED.");
  }
  imuCalibrating=false;
}

