makarioussafa/Rovey_Mobile_Robot/Hardware_Codes/PID_ESP32_USB_SERIAL_ROS2_GUI_TCP_IMU_DIAG__copy_20260618051121.ino
void updateIMU() {
  if (!imuReady || imuCalibrating) return;
  int16_t axRaw,ayRaw,azRaw,tempRaw,gxRaw,gyRaw,gzRaw;
  if (!readMPURaw(axRaw,ayRaw,azRaw,tempRaw,gxRaw,gyRaw,gzRaw)) {
    imuReadFailCount++;
    lastImuFailMs=millis();
    return;
  }
  if (!imuRawSampleLooksAlive(axRaw, ayRaw, azRaw)) {
    imuReadInvalidCount++;
    lastImuFailMs=millis();
    return;
  }
  imuReadOkCount++;
  lastImuOkMs=millis();
  uint32_t now=micros();
  float dt=(now-lastImuMicros)/1000000.0f;
  lastImuMicros=now;
  if (dt<=0||dt>0.1f) return;
  float ax=((float)axRaw/ACC_SENS)-axOffset;
  float ay=((float)ayRaw/ACC_SENS)-ayOffset;
  float az=((float)azRaw/ACC_SENS)-azOffset;
  float gx=((float)gxRaw/GYRO_SENS)-gxOffset;
  float gy=((float)gyRaw/GYRO_SENS)-gyOffset;
  float gz=((float)gzRaw/GYRO_SENS)-gzOffset;
  const float accA=0.15f,gyroA=0.15f;
  accXf=(1-accA)*accXf+accA*ax; accYf=(1-accA)*accYf+accA*ay;
  accZf=(1-accA)*accZf+accA*az; gyroZf=(1-gyroA)*gyroZf+gyroA*gz;
  gyroXDegS=gx; gyroYDegS=gy; gyroZDegS=gyroZf;
  float rollAcc =atan2f(accYf,accZf)*180.0f/PI;
  float pitchAcc=atan2f(-accXf,sqrtf(accYf*accYf+accZf*accZf))*180.0f/PI;
  imuRollDeg =0.98f*(imuRollDeg +gx*dt)+0.02f*rollAcc;
  imuPitchDeg=0.98f*(imuPitchDeg+gy*dt)+0.02f*pitchAcc;
  imuYawDeg +=gyroZf*dt;
  imuYawDeg  =wrapAngle180(imuYawDeg);
}

// =====================================================
// Motion Planner
// =====================================================
void updateManualDriveTargets() {
  uint32_t nowMs = millis();

  if (guiMode != GUI_MODE_MANUAL ||
      manualDriveDir == MANUAL_DIR_STOP ||
      manualDriveSpeed == 0 ||
      (uint32_t)(nowMs - lastManualDriveMs) > MANUAL_DRIVE_TIMEOUT_MS) {
    targVx = 0;
    targVy = 0;
    targWz = 0;
    manualDriveDir = MANUAL_DIR_STOP;
    manualDriveSpeed = 0;
    manualHoldYawValid = false;
    manualHoldYawDir = MANUAL_DIR_STOP;
    return;
  }

  if (!manualDirectionAllowedBySensors(manualDriveDir)) {
    targVx = 0.0f;
    targVy = 0.0f;
    targWz = 0.0f;
    manualDriveDir = MANUAL_DIR_STOP;
    manualDriveSpeed = 0;
    manualHoldYawValid = false;
    manualHoldYawDir = MANUAL_DIR_STOP;
    return;
  }

  float pct = clampFloat((float)manualDriveSpeed, MANUAL_SPEED_MIN_PERCENT, 100.0f) / 100.0f;
  float manualLinearMax = (MANUAL_LINEAR_SPEED_PERCENT / 100.0f) * MAX_MPS;
  float manualLateralMax = manualLinearMax * MANUAL_LATERAL_SPEED_SCALE;
  float manualAngularMax = (TURN_SPEED_PERCENT / 100.0f) * MAX_WZ;
  float linear = clampFloat(pct * manualLinearMax, MIN_MOVE_SPEED_MPS, manualLinearMax);
  float lateral = clampFloat(pct * manualLateralMax, MIN_MOVE_SPEED_MPS, manualLateralMax);
  float angular = clampFloat(pct * manualAngularMax, TURN_FINE_MIN_WZ, manualAngularMax);
  const float diag = 0.70710678f;

  targVx = 0;
  targVy = 0;
  targWz = 0;

  switch (manualDriveDir) {
    case MANUAL_DIR_FWD:        targVx =  linear; break;
    case MANUAL_DIR_BACK:       targVx = -linear; break;
    case MANUAL_DIR_LEFT:       targVy =  lateral; break;
    case MANUAL_DIR_RIGHT:      targVy = -lateral; break;
    case MANUAL_DIR_FWD_LEFT:   targVx =  linear * diag; targVy =  lateral * diag; break;
    case MANUAL_DIR_FWD_RIGHT:  targVx =  linear * diag; targVy = -lateral * diag; break;
    case MANUAL_DIR_BACK_LEFT:  targVx = -linear * diag; targVy =  lateral * diag; break;
    case MANUAL_DIR_BACK_RIGHT: targVx = -linear * diag; targVy = -lateral * diag; break;
    case MANUAL_DIR_ROT_L:      targWz =  angular; break;
    case MANUAL_DIR_ROT_R:      targWz = -angular; break;
    default: break;
  }

  bool translationalManualMove = (targVx != 0.0f || targVy != 0.0f) && targWz == 0.0f;
  if (translationalManualMove) {
    if (!isImuLiveNow()) {
      targVx = 0.0f;
      targVy = 0.0f;
      targWz = 0.0f;
      manualDriveDir = MANUAL_DIR_STOP;
      manualDriveSpeed = 0;
      manualHoldYawValid = false;
      manualHoldYawDir = MANUAL_DIR_STOP;
      return;
    }

    if (!manualHoldYawValid || manualHoldYawDir != manualDriveDir) {
      manualHoldYawDeg = imuYawDeg;
      manualHoldForwardM = getForwardEncoderDistanceM();
      manualHoldLateralM = getLateralEncoderDistanceM();
      manualHoldYawValid = true;
      manualHoldYawDir = manualDriveDir;
      moveYawIntegralRad = 0.0f;
    }

    float ye = angleDiffDeg(manualHoldYawDeg, imuYawDeg);
    float yeRad = ye * PI / 180.0f;
    float gyroZRadS = gyroZDegS * PI / 180.0f;
    moveYawIntegralRad = clampFloat(moveYawIntegralRad + (yeRad * PLANNER_DT), -MOVE_YAW_I_LIMIT, MOVE_YAW_I_LIMIT);
    float corr = clampFloat((KP_MOVE_YAW * yeRad) + (KI_MOVE_YAW * moveYawIntegralRad) - (KD_MOVE_YAW * gyroZRadS), -MAX_MANUAL_YAW_CORR, MAX_MANUAL_YAW_CORR);

    if (fabsf(ye) < MOVE_YAW_DEADBAND_DEG && fabsf(gyroZDegS) < MOVE_YAW_RATE_DEADBAND_DPS) {
      corr = 0.0f;
      moveYawIntegralRad = 0.0f;
    }

    targWz = MOVE_YAW_CONTROL_SIGN * corr;

    float yawAbs = fabsf(ye);
    float rateAbs = fabsf(gyroZDegS);
    if (yawAbs > MANUAL_YAW_SLOWDOWN_DEG || rateAbs > MANUAL_YAW_SLOWDOWN_RATE_DPS) {
      float yawScale = 1.0f;
      if (yawAbs > MANUAL_YAW_SLOWDOWN_DEG) {
        yawScale = 1.0f - ((yawAbs - MANUAL_YAW_SLOWDOWN_DEG) /
                           (MANUAL_YAW_FULL_SLOWDOWN_DEG - MANUAL_YAW_SLOWDOWN_DEG));
      }
      float rateScale = 1.0f;
      if (rateAbs > MANUAL_YAW_SLOWDOWN_RATE_DPS) {
        rateScale = MANUAL_YAW_SLOWDOWN_RATE_DPS / rateAbs;
      }
      float linearScale = clampFloat(fminf(yawScale, rateScale),
                                     MANUAL_YAW_MIN_LINEAR_SCALE, 1.0f);
      targVx *= linearScale;
      targVy *= linearScale;
    }

    float linearNorm = sqrtf((targVx * targVx) + (targVy * targVy));
    if (linearNorm > 0.001f) {
      float ux = targVx / linearNorm;
      float uy = targVy / linearNorm;
      float nx = -uy;
      float ny = ux;
      float dx = getForwardEncoderDistanceM() - manualHoldForwardM;
      float dy = getLateralEncoderDistanceM() - manualHoldLateralM;
      float crossTrackErrorM = (dx * nx) + (dy * ny);
      float lineCorr = -crossTrackCorrectionMps(crossTrackErrorM);
      targVx += lineCorr * nx;
      targVy += lineCorr * ny;
    }
  } else {
    manualHoldYawValid = false;
    manualHoldYawDir = MANUAL_DIR_STOP;
  }
}

void updateMotionPlanner() {
  RobotMode mode = robotMode;
  if (mode == MODE_IDLE) {
    updateManualDriveTargets();
    return;
  }

  if (!isImuLiveNow()) {
    pathAborted = true;
    stopRobotHard();
    return;
  }

  float spd = clampFloat(gSpd, 0.05f, 1.0f);

