makarioussafa/Rovey_Mobile_Robot/Hardware_Codes/PID_ESP32_USB_SERIAL_ROS2_GUI_TCP_IMU_DIAG__copy_20260618051121.ino
  if (mode == MODE_MOVE_DISTANCE) {
    float now   = getForwardEncoderDistanceM();
    float moved = now - moveStartForwardM;
    float rem   = moveTargetDistanceM - moved;
    moveDoneM=moved; moveRemainingM=rem;
    if (fabsf(rem)<=DIST_TOLERANCE_M) { goalReached=true; stopRobotHard(); return; }
    float dir=signFloat(rem);
    float ms=clampFloat(spd*MAX_MPS,MIN_MOVE_SPEED_MPS,MAX_MPS);
    float cs=ms; if(fabsf(rem)<SLOWDOWN_DISTANCE_M) cs=clampFloat(ms*fabsf(rem)/SLOWDOWN_DISTANCE_M,MIN_MOVE_SPEED_MPS,ms);
    float lateralErrorM = moveStartLateralM - getLateralEncoderDistanceM();
    targVx=dir*cs; targVy=crossTrackCorrectionMps(lateralErrorM);
    float ye=angleDiffDeg(moveTargetYawDeg,imuYawDeg);
    float yeRad = ye * PI / 180.0f;
    float gyroZRadS = gyroZDegS * PI / 180.0f;
    moveYawIntegralRad = clampFloat(moveYawIntegralRad + (yeRad * PLANNER_DT), -MOVE_YAW_I_LIMIT, MOVE_YAW_I_LIMIT);
    float corr=clampFloat((KP_MOVE_YAW*yeRad) + (KI_MOVE_YAW*moveYawIntegralRad) - (KD_MOVE_YAW*gyroZRadS), -MAX_MOVE_YAW_CORR, MAX_MOVE_YAW_CORR);
    if (fabsf(ye) < MOVE_YAW_DEADBAND_DEG && fabsf(gyroZDegS) < MOVE_YAW_RATE_DEADBAND_DPS) {
      corr = 0.0f;
      moveYawIntegralRad = 0.0f;
    }
    targWz=MOVE_YAW_CONTROL_SIGN * corr; turnAngleErrorDeg=ye;
  }
  else if (mode == MODE_STRAFE_DISTANCE) {
    float now   = getLateralEncoderDistanceM();
    float moved = now - strafeStartLateralM;
    float rem   = strafeTargetDistanceM - moved;
    strafeDoneM=moved; strafeRemainingM=rem;
    if (fabsf(rem)<=DIST_TOLERANCE_M) { goalReached=true; stopRobotHard(); return; }
    float dir=signFloat(rem);
    float ms=clampFloat(spd*MAX_MPS,MIN_MOVE_SPEED_MPS,MAX_MPS);
    float cs=ms; if(fabsf(rem)<SLOWDOWN_DISTANCE_M) cs=clampFloat(ms*fabsf(rem)/SLOWDOWN_DISTANCE_M,MIN_MOVE_SPEED_MPS,ms);
    float forwardErrorM = strafeStartForwardM - getForwardEncoderDistanceM();
    targVx=crossTrackCorrectionMps(forwardErrorM); targVy=dir*cs;
    float ye=angleDiffDeg(strafeTargetYawDeg,imuYawDeg);
    float yeRad = ye * PI / 180.0f;
    float gyroZRadS = gyroZDegS * PI / 180.0f;
    moveYawIntegralRad = clampFloat(moveYawIntegralRad + (yeRad * PLANNER_DT), -MOVE_YAW_I_LIMIT, MOVE_YAW_I_LIMIT);
    float corr=clampFloat((KP_MOVE_YAW*yeRad) + (KI_MOVE_YAW*moveYawIntegralRad) - (KD_MOVE_YAW*gyroZRadS), -MAX_MOVE_YAW_CORR, MAX_MOVE_YAW_CORR);
    if (fabsf(ye) < MOVE_YAW_DEADBAND_DEG && fabsf(gyroZDegS) < MOVE_YAW_RATE_DEADBAND_DPS) {
      corr = 0.0f;
      moveYawIntegralRad = 0.0f;
    }
    targWz=MOVE_YAW_CONTROL_SIGN * corr; turnAngleErrorDeg=ye;
  }
  else if (mode == MODE_TURN_ANGLE) {
    float errDeg = angleDiffDeg(turnTargetYawDeg, imuYawDeg);
    float errRad = errDeg * PI / 180.0f;
    float gyroZRadS = gyroZDegS * PI / 180.0f;
    turnAngleErrorDeg = errDeg;

    // Turn PD controller:
    //   P term rotates toward the target angle.
    //   D term damps current gyro rotation to reduce overshoot.
    if (fabsf(errDeg) <= ANGLE_TOLERANCE_DEG && fabsf(gyroZDegS) < TURN_STOP_GYRO_DPS) {
      goalReached = true;
      stopRobotHard();
      return;
    }

    float wMax = clampFloat(spd * MAX_WZ, MIN_TURN_WZ, MAX_WZ);

    // Braking limit becomes smaller as the angle error gets smaller.
    float wBrake = sqrtf(2.0f * (MAX_WZ / DECEL_TIME_W) * fabsf(errRad));
    float wLimit = clampFloat(fminf(wMax, wBrake), TURN_FINE_MIN_WZ, wMax);

    bool turnStalled = false;
    if (fabsf(errDeg) > ANGLE_TOLERANCE_DEG && fabsf(gyroZDegS) < TURN_STALL_GYRO_DPS) {
      if (turnStallStartMs == 0) {
        turnStallStartMs = millis();
      }
      if ((uint32_t)(millis() - turnStallStartMs) >= TURN_STALL_TIME_MS) {
        turnStalled = true;
      }
    } else {
      turnStallStartMs = 0;
      turnStallBoostActive = false;
    }
    turnStallBoostActive = turnStalled;
    if (turnStallBoostActive) {
      wLimit = clampFloat(fmaxf(wLimit, TURN_STALL_BOOST_WZ), TURN_STALL_BOOST_WZ, wMax);
    }

    // Signed PD output. If the robot is still spinning fast toward the target,
    // the gyro term reduces command before overshoot happens.
    float wCmd = (KP_TURN * errRad) - (KD_TURN * gyroZRadS);
    wCmd = clampFloat(wCmd, -wLimit, wLimit);

    // Avoid motor stiction, but use a much smaller minimum near the target.
    float minAllowed = (fabsf(errDeg) <= TURN_FINE_ZONE_DEG) ? TURN_FINE_MIN_WZ : MIN_TURN_WZ;
    if (turnStallBoostActive) {
      minAllowed = fmaxf(minAllowed, TURN_STALL_BOOST_WZ);
    }
    if (fabsf(wCmd) < minAllowed && fabsf(errDeg) > ANGLE_TOLERANCE_DEG) {
      // If gyro is already high, allow PD braking/reversal instead of forcing
      // more speed toward the target.
      if (fabsf(gyroZDegS) < 8.0f || signFloat(wCmd) == signFloat(errRad)) {
        wCmd = signFloat(errRad) * minAllowed;
      }
    }

    targVx = 0;
    targVy = 0;
    targWz = TURN_YAW_CONTROL_SIGN * wCmd;
  }
}

// =====================================================
// String Helpers
// =====================================================
const char* modeName(RobotMode mode) {
  switch (mode) {
    case MODE_IDLE:            return "IDLE";
    case MODE_MOVE_DISTANCE:   return "MOVE_DISTANCE";
    case MODE_STRAFE_DISTANCE: return "STRAFE_DISTANCE";
    case MODE_TURN_ANGLE:      return "TURN_ANGLE";
    default:                   return "UNKNOWN";
  }
}

const char* pathStepName(int step) {
  switch (step) {
    case 0: return "INITIALIZING";
    case 1: return "FWD 2.77 m  (heading 0)";
    case 2: return "TURN +90 deg";
    case 3: return "FWD 1.55 m  (heading +90)";
    case 4: return "TURN +90 deg";
    case 5: return "FWD 2.77 m  (heading -180)";
    case 6: return "TURN +90 deg";
    case 7: return "FWD 1.55 m  (heading -90)";
    case 8: return "TURN +90 deg";
    case 9: return "COMPLETE";
    default: return "UNKNOWN";
  }
}

const char* obstacleStateName(uint8_t state) {
  switch (state) {
    case 0: return "CLEAR";
    case 1: return "DETECTED - STOPPING";
    case 2: return "WAITING - STATIC CHECK (5s)";
    case 3: return "DYNAMIC - CONTINUING";
    case 4: return "AVOIDING OBSTACLE";
    case 5: return "ALL SENSORS BLOCKED - WAITING";
    default: return "UNKNOWN";
  }
}

