makarioussafa/Rovey_Mobile_Robot/Hardware_Codes/PID_ESP32_USB_SERIAL_ROS2_GUI_TCP_IMU_DIAG__copy_20260618051121.ino
// =====================================================
// Path Helper Functions
// =====================================================
void startMoveDistanceM(float dist, float speedPct, float yaw) {
  stopRobotHard();
  goalReached=false;
  gSpd=clampFloat(speedPct,5.0f,100.0f)/100.0f;
  moveTargetDistanceM=dist;
  moveStartForwardM=getForwardEncoderDistanceM();
  moveStartLateralM=getLateralEncoderDistanceM();
  moveTargetYawDeg=yaw;
  moveDoneM=0; moveRemainingM=dist; turnAngleErrorDeg=0; moveYawIntegralRad=0.0f;
  resetAllPid();
  robotMode=MODE_MOVE_DISTANCE;
}

void startStrafeDistanceM(float dist, float speedPct, float yaw) {
  stopRobotHard();
  goalReached=false;
  gSpd=clampFloat(speedPct,5.0f,100.0f)/100.0f;
  strafeTargetDistanceM=dist;
  strafeStartLateralM=getLateralEncoderDistanceM();
  strafeStartForwardM=getForwardEncoderDistanceM();
  strafeTargetYawDeg=yaw;
  strafeDoneM=0; strafeRemainingM=dist; turnAngleErrorDeg=0; moveYawIntegralRad=0.0f;
  resetAllPid();
  robotMode=MODE_STRAFE_DISTANCE;
}

void startTurnRelativeDeg(float angle, float speedPct) {
  stopRobotHard();
  goalReached=false;
  gSpd=clampFloat(speedPct,5.0f,100.0f)/100.0f;
  turnTargetYawDeg=wrapAngle180(imuYawDeg+angle);
  turnAngleErrorDeg=angleDiffDeg(turnTargetYawDeg,imuYawDeg);
  moveDoneM=0; moveRemainingM=0; strafeDoneM=0; strafeRemainingM=0; moveYawIntegralRad=0.0f;
  turnStallStartMs=0; turnStallBoostActive=false;
  resetAllPid();
  robotMode=MODE_TURN_ANGLE;
}

void startTurnAbsoluteDeg(float targetYawDeg, float speedPct) {
  stopRobotHard();
  goalReached=false;
  gSpd=clampFloat(speedPct,5.0f,100.0f)/100.0f;
  turnTargetYawDeg=wrapAngle180(targetYawDeg);
  turnAngleErrorDeg=angleDiffDeg(turnTargetYawDeg,imuYawDeg);
  moveDoneM=0; moveRemainingM=0; strafeDoneM=0; strafeRemainingM=0; moveYawIntegralRad=0.0f;
  turnStallStartMs=0; turnStallBoostActive=false;
  resetAllPid();
  robotMode=MODE_TURN_ANGLE;
}


void sendSensorEspCommand(uint8_t cmd) {
  // Converted from legacy I2C command to ROS 2 command topic.
  if (cmd == SENSOR_CMD_CLEAR_DECISION) {
    publishClearDecisionCommand();
  } else if (cmd == SENSOR_CMD_ARM_VISION) {
    publishArmVisionCommand(true);
  } else {
    DebugSerial.printf("WARN: unknown sensor/mechanism command 0x%02X\n", cmd);
  }
}

void clearConsumedDecision() {
  userDecision = DECISION_NONE;
  sendSensorEspCommand(SENSOR_CMD_CLEAR_DECISION);
  // Also force the Pi vision gate OFF through the Sensor/Mechanism ESP relay.
  // This tells the Sensor/Mechanism ESP32 to stop accepting stale toy messages.
  publishArmVisionCommand(false);
}

void softwareResetZeroState() {
  stopRobotHard();
  resetTicks();
  resetAllPid();
  setSetpointsZero();

  odomX = 0.0f;
  odomY = 0.0f;
  moveDoneM = 0.0f;
  moveRemainingM = 0.0f;
  moveStartForwardM = 0.0f;
  moveStartLateralM = 0.0f;
  strafeDoneM = 0.0f;
  strafeRemainingM = 0.0f;
  strafeStartLateralM = 0.0f;
  strafeStartForwardM = 0.0f;
  manualHoldForwardM = 0.0f;
  manualHoldLateralM = 0.0f;
  currentSegmentDoneM = 0.0f;
  currentSegmentRemainingM = 0.0f;

  currentPathStep = 0;
  pathRunning = false;
  pathFinished = false;
  pathAborted = false;
  obstacleState = 0;
  lastStaticObstacleMask = 0;
  lastAvoidSide = 0;

  guiMode = GUI_MODE_AUTO;
  autoStartRequested = false;
  autoAbortRequested = false;
  manualDriveDir = MANUAL_DIR_STOP;
  manualDriveSpeed = 0;
  manualHoldYawDeg = imuYawDeg;
  manualHoldYawValid = false;
  manualHoldYawDir = MANUAL_DIR_STOP;

  imuReadOkCount = 0;
  imuReadFailCount = 0;
  lastImuFailMs = 0;

  clearConsumedDecision();
  imuCalibrationRequested = true;
}

const char* decisionName(uint8_t d) {
  switch (d) {
    case DECISION_TOY:      return "TOY";
    case DECISION_OBSTACLE: return "OBSTACLE";
    default:                return "NONE";
  }
}

const char* mechanismStateName(uint8_t s) {
  switch (s) {
    case MECH_STATE_IDLE:    return "IDLE";
    case MECH_STATE_RUNNING: return "RUNNING";
    case MECH_STATE_DONE:    return "DONE";
    case MECH_STATE_ERROR:   return "ERROR";
    default:                 return "UNKNOWN";
  }
}

uint8_t waitForPiToyOrAutoObstacleDecision() {
  DebugSerial.println("Static S2 obstacle confirmed: arming Pi vision window on merged sensor/mechanism ESP...");
  DebugSerial.println("Pi has up to 15 s to send TOY after the 5 s static check. Max wait is 20 s total.");

  // Remove any stale decision from a previous object, then arm the merged ESP
  // so it accepts Pi TOY messages only during this static-obstacle window.
  clearConsumedDecision();
  sendSensorEspCommand(SENSOR_CMD_ARM_VISION);

  uint32_t start = millis();
  uint32_t lastArmBurstMs = 0;

  while ((uint32_t)(millis() - start) < PI_TOY_WAIT_MS) {
    if (pathAborted) return DECISION_NONE;

    // Keep re-publishing arm during the decision window.
    // This protects against a lost best-effort packet and makes /vision/arm visible to the Pi.
    uint32_t nowMs = millis();
    if ((uint32_t)(nowMs - lastArmBurstMs) >= 400u) {
      lastArmBurstMs = nowMs;
      publishArmVisionCommand(true);
    }

    uint8_t d = userDecision;
    if (d == DECISION_TOY) {
      DebugSerial.println("Pi vision decision received from merged ESP: TOY.");
      return DECISION_TOY;
    }

    // Manual OBSTACLE is no longer required, but keep compatibility if the
    // existing HTTP/Serial command is used during testing.
    if (d == DECISION_OBSTACLE) {
      DebugSerial.println("OBSTACLE decision received from merged ESP.");
      return DECISION_OBSTACLE;
    }

    stopRobotHard();
    vTaskDelay(pdMS_TO_TICKS(20));
  }

  DebugSerial.println("No Pi TOY decision arrived in time -> auto OBSTACLE avoidance.");
  clearConsumedDecision();   // also disarms the Pi vision window on the merged ESP
  return DECISION_OBSTACLE;
}

bool waitForMechanismToFinish() {
  DebugSerial.println("TOY decision: waiting until mechanism task and homing sequence finish...");

  // Ignore stale IDLE/DONE from startup homing. After the 12 cm approach,
  // the robot may continue only after the mechanism reports RUNNING and then
  // returns to DONE or IDLE.
  bool mechanismStarted = false;
  uint32_t lastMechanismRunCmdMs = 0;

  while (true) {
    if (pathAborted) return false;

