makarioussafa/Rovey_Mobile_Robot/Hardware_Codes/PID_ESP32_USB_SERIAL_ROS2_GUI_TCP_IMU_DIAG__copy_20260618051121.ino
    uint32_t nowMs = millis();

    uint8_t ms = mechanismState;

    if (ms == MECH_STATE_RUNNING) {
      mechanismStarted = true;
    }

    if (!mechanismStarted &&
        (lastMechanismRunCmdMs == 0 ||
         (uint32_t)(nowMs - lastMechanismRunCmdMs) >= 400u)) {
      lastMechanismRunCmdMs = nowMs;
      publishMechanismRunCommand();
    }

    if (mechanismStarted && (ms == MECH_STATE_DONE || ms == MECH_STATE_IDLE)) {
      DebugSerial.printf("Mechanism task/homing finished/state=%s. Continuing path.\n", mechanismStateName(ms));
      clearConsumedDecision();
      return true;
    }

    if (ms == MECH_STATE_ERROR) {
      DebugSerial.println("ERROR: mechanism ESP reported MECH_STATE_ERROR. Path aborted for safety.");
      pathAborted = true;
      return false;
    }

    stopRobotHard();
    vTaskDelay(pdMS_TO_TICKS(50));
  }
}

bool waitMotionDoneNoObstacle() {
  while (true) {
    if (goalReached && robotMode==MODE_IDLE) return true;
    if (pathAborted) return false;
    if (!isImuLiveNow()) {
      pathAborted = true;
      stopRobotHard();
      return false;
    }

    vTaskDelay(pdMS_TO_TICKS(5));
  }
}

// =====================================================
// Avoidance Decision + Obstacle Wait Helpers
// =====================================================

// Full avoidance direction decision.
// Return values after requested reversal:
//   +1 = avoid LEFT
//   -1 = avoid RIGHT
//    0 = no avoidance direction / not a front obstacle case
int8_t decideAvoidSideFromMask(uint8_t mask) {
  bool s1 = (mask & SENSOR_1_RIGHT_MASK)  != 0;
  bool s2 = (mask & SENSOR_2_MIDDLE_MASK) != 0;
  bool s3 = (mask & SENSOR_3_LEFT_MASK)   != 0;

  // All-three block is handled before calling this function.
  if (s1 && s2 && s3) return 0;

  // Reversed avoidance task:
  // S1 + S2 now avoids RIGHT instead of LEFT.
  if (s1 && s2 && !s3) return -1;

  // S2 + S3 now avoids LEFT instead of RIGHT.
  if (!s1 && s2 && s3) return +1;

  // S2 only now avoids RIGHT by default instead of LEFT.
  if (!s1 && s2 && !s3) return -1;

  // S1 only, S3 only, S1 + S3 only:
  // side obstacle cases, not avoidance cases.
  return 0;
}

// 5-second static/dynamic check after S2 is involved.
bool waitForStaticCheck() {
  obstacleState = 2;
  uint32_t start = millis();

  while ((uint32_t)(millis() - start) < STATIC_CHECK_TIME_MS) {
    if (pathAborted) return false;
    vTaskDelay(pdMS_TO_TICKS(50));
  }

  return true;
}

// Used when S1 and/or S3 detects without S2.
// Robot waits until side sensors clear, then waits 3 stable seconds,
// then continues the same segment.
bool waitUntilSideSensorsClearThenContinue() {
  obstacleState = 2;

  // Wait until S1 and S3 are clear.
  while (true) {
    if (pathAborted) return false;

    uint8_t maskNow = sensorMask & 0x07;

    // If S2 appears while waiting, return to main obstacle logic.
    if (maskNow & SENSOR_2_MIDDLE_MASK) {
      return true;
    }

    bool sideSensorsClear =
      ((maskNow & SENSOR_1_RIGHT_MASK) == 0) &&
      ((maskNow & SENSOR_3_LEFT_MASK)  == 0);

    if (sideSensorsClear) break;

    stopRobotHard();
    vTaskDelay(pdMS_TO_TICKS(50));
  }

  // After S1/S3 are clear, wait 3 stable seconds.
  uint32_t clearStart = millis();

  while ((uint32_t)(millis() - clearStart) < SIDE_CLEAR_CONTINUE_DELAY_MS) {
    if (pathAborted) return false;

    uint8_t maskNow = sensorMask & 0x07;

    // If S2 appears during the clear delay, return to main obstacle logic.
    if (maskNow & SENSOR_2_MIDDLE_MASK) {
      return true;
    }

    // If S1 or S3 detects again, restart the 3-second stable timer.
    if ((maskNow & SENSOR_1_RIGHT_MASK) || (maskNow & SENSOR_3_LEFT_MASK)) {
      clearStart = millis();
    }

    stopRobotHard();
    vTaskDelay(pdMS_TO_TICKS(50));
  }

  obstacleState = 0;
  return true;
}

// Used when S1 + S2 + S3 are all detecting.
// Robot waits indefinitely while all three remain active.
// Once the mask changes, the new mask is returned and handled normally.
uint8_t waitWhileAllSensorsBlocked() {
  obstacleState = 5;

  const uint8_t ALL_SENSORS_MASK =
    SENSOR_1_RIGHT_MASK | SENSOR_2_MIDDLE_MASK | SENSOR_3_LEFT_MASK;

  while (true) {
    if (pathAborted) return 0xFF;

    uint8_t maskNow = sensorMask & 0x07;

    if (maskNow != ALL_SENSORS_MASK) {
      return maskNow;
    }

    stopRobotHard();
    vTaskDelay(pdMS_TO_TICKS(50));
  }
}

bool performAvoidance(int8_t side, float avoidYawDeg) {
  if (side == 0) return false;

  obstacleState = 4;
  lastAvoidSide = side;

  float originalYawDeg = wrapAngle180(avoidYawDeg);
  float firstSideYawDeg = wrapAngle180(originalYawDeg - (90.0f * (float)side));
  float secondSideYawDeg = wrapAngle180(originalYawDeg + (90.0f * (float)side));

  DebugSerial.printf("Turn-based avoidance: side=%+d originalYaw=%.1f firstYaw=%.1f secondYaw=%.1f sideDist=%.3f forwardDist=%.3f\n",
                     side,
                     originalYawDeg,
                     firstSideYawDeg,
                     secondSideYawDeg,
                     AVOID_SIDE_DISTANCE_M,
                     AVOID_FORWARD_DISTANCE_M);

  // Full avoidance logic:
  // 1) rotate 90 deg using the reversed avoidance angle
  //    (S2-only currently selects side=-1, so this is rotate +90 as requested)
  // 2) drive forward by the same old strafe distance, 0.35 m
  // 3) rotate back to the original path heading
  // 4) drive forward by the old forward bypass distance, 1.20 m
  // 5) rotate -90 deg for the normal S2-only case
  // 6) drive forward 0.35 m to return to the original lane
  // 7) rotate back to the original path heading and continue the remaining path
  startTurnAbsoluteDeg(firstSideYawDeg, TURN_SPEED_PERCENT);
  if (!waitMotionDoneNoObstacle()) return false;

  startMoveDistanceM(AVOID_SIDE_DISTANCE_M, AVOID_SPEED_PERCENT, firstSideYawDeg);
  if (!waitMotionDoneNoObstacle()) return false;

  startTurnAbsoluteDeg(originalYawDeg, TURN_SPEED_PERCENT);
  if (!waitMotionDoneNoObstacle()) return false;

  startMoveDistanceM(AVOID_FORWARD_DISTANCE_M, AVOID_SPEED_PERCENT, originalYawDeg);
  if (!waitMotionDoneNoObstacle()) return false;

