makarioussafa/Rovey_Mobile_Robot/Hardware_Codes/PID_ESP32_USB_SERIAL_ROS2_GUI_TCP_IMU_DIAG__copy_20260618051121.ino
  startTurnAbsoluteDeg(secondSideYawDeg, TURN_SPEED_PERCENT);
  if (!waitMotionDoneNoObstacle()) return false;

  startMoveDistanceM(AVOID_SIDE_DISTANCE_M, AVOID_SPEED_PERCENT, secondSideYawDeg);
  if (!waitMotionDoneNoObstacle()) return false;

  startTurnAbsoluteDeg(originalYawDeg, TURN_SPEED_PERCENT);
  if (!waitMotionDoneNoObstacle()) return false;

  obstacleState = 0;
  return true;
}

// =====================================================
// Forward Segment with Obstacle Avoidance
// =====================================================
bool runForwardSegmentWithAvoidance(float segDist, float yaw) {
  float completedM = 0.0f;

  while (completedM < segDist - DIST_TOLERANCE_M) {
    if (!isImuLiveNow()) {
      pathAborted = true;
      stopRobotHard();
      return false;
    }

    float cmdDist = segDist - completedM;

    currentSegmentDoneM = completedM;
    currentSegmentRemainingM = cmdDist;

    startMoveDistanceM(cmdDist, PATH_SPEED_PERCENT, yaw);

    while (true) {
      currentSegmentDoneM = completedM + fabsf(moveDoneM);
      currentSegmentRemainingM = segDist - currentSegmentDoneM;

      if (!isImuLiveNow()) {
        pathAborted = true;
        stopRobotHard();
        return false;
      }

      // Sub-segment finished cleanly
      if (goalReached && robotMode == MODE_IDLE) {
        completedM = segDist;
        currentSegmentDoneM = completedM;
        currentSegmentRemainingM = 0.0f;
        obstacleState = 0;
        break;
      }

      uint8_t maskNow = sensorMask & 0x07;

      // ANY sensor detection stops the robot.
      if (maskNow != 0) {
        obstacleState = 1;

        float doneBeforeStop = fabsf(moveDoneM);
        stopRobotHard();

        // Re-evaluate masks until the situation becomes one of:
        //   clear, side-only, or front/S2 obstacle.
        while (true) {
          if (pathAborted) {
            stopRobotHard();
            return false;
          }

          maskNow = sensorMask & 0x07;

          const uint8_t ALL_SENSORS_MASK =
            SENSOR_1_RIGHT_MASK | SENSOR_2_MIDDLE_MASK | SENSOR_3_LEFT_MASK;

          // S1 + S2 + S3:
          // wait indefinitely until at least one sensor clears,
          // then re-evaluate the new mask.
          if (maskNow == ALL_SENSORS_MASK) {
            lastStaticObstacleMask = maskNow;
            maskNow = waitWhileAllSensorsBlocked();

            if (maskNow == 0xFF) {
              pathAborted = true;
              stopRobotHard();
              return false;
            }

            // Continue the inner re-evaluation with the new mask.
            continue;
          }

          // All sensors clear:
          // wait 3 stable seconds, then continue same segment.
          if (maskNow == 0) {
            obstacleState = 3;

            uint32_t clearStart = millis();
            bool frontAppeared = false;

            while ((uint32_t)(millis() - clearStart) < SIDE_CLEAR_CONTINUE_DELAY_MS) {
              if (pathAborted) {
                stopRobotHard();
                return false;
              }

              uint8_t stableMask = sensorMask & 0x07;

              if (stableMask == ALL_SENSORS_MASK) {
                frontAppeared = true;
                break;
              }

              if (stableMask & SENSOR_2_MIDDLE_MASK) {
                frontAppeared = true;
                break;
              }

              if (stableMask != 0) {
                clearStart = millis();
              }

              stopRobotHard();
              vTaskDelay(pdMS_TO_TICKS(50));
            }

            if (frontAppeared) {
              continue;
            }

            completedM += doneBeforeStop;
            currentSegmentDoneM = completedM;
            currentSegmentRemainingM = segDist - completedM;
            obstacleState = 0;
            break;
          }

          // S1/S3 side-only case, without S2:
          // wait until side sensors clear, then wait 3 stable seconds,
          // then continue same segment.
          if ((maskNow & SENSOR_2_MIDDLE_MASK) == 0) {
            lastStaticObstacleMask = maskNow;

            if (!waitUntilSideSensorsClearThenContinue()) {
              pathAborted = true;
              stopRobotHard();
              return false;
            }

            // If S2 appeared while the side-wait helper was running,
            // re-evaluate instead of continuing.
            uint8_t afterSideWaitMask = sensorMask & 0x07;
            if (afterSideWaitMask & SENSOR_2_MIDDLE_MASK) {
              continue;
            }

            completedM += doneBeforeStop;
            currentSegmentDoneM = completedM;
            currentSegmentRemainingM = segDist - completedM;
            obstacleState = 0;
            break;
          }

          // S2 is involved:
          // enter the static/dynamic check loop.
          if (!waitForStaticCheck()) return false;

          uint8_t staticMask = sensorMask & 0x07;

          // If all three are still active after the 5-second check,
          // wait indefinitely until any sensor clears,
          // then re-evaluate the new sensor mask.
          if (staticMask == ALL_SENSORS_MASK) {
            lastStaticObstacleMask = staticMask;
            staticMask = waitWhileAllSensorsBlocked();

            if (staticMask == 0xFF) {
              pathAborted = true;
              stopRobotHard();
              return false;
            }

            // Re-evaluate using the changed mask.
            continue;
          }

          // Dynamic obstacle:
          // If all sensors are clear after the 5-second check,
          // continue from stopped position.
          if (staticMask == 0) {
            obstacleState = 3;

            completedM += doneBeforeStop;
            currentSegmentDoneM = completedM;
            currentSegmentRemainingM = segDist - completedM;

            vTaskDelay(pdMS_TO_TICKS(200));
            obstacleState = 0;
            break;
          }

          // If after the 5-second check S2 is no longer active,
          // but S1/S3 are still active, treat it as side-only wait.
          if ((staticMask & SENSOR_2_MIDDLE_MASK) == 0) {
            lastStaticObstacleMask = staticMask;

