makarioussafa/Rovey_Mobile_Robot/Hardware_Codes/PID_ESP32_USB_SERIAL_ROS2_GUI_TCP_IMU_DIAG__copy_20260618051121.ino
            if (!waitUntilSideSensorsClearThenContinue()) {
              pathAborted = true;
              stopRobotHard();
              return false;
            }

            uint8_t afterSideWaitMask = sensorMask & 0x07;
            if (afterSideWaitMask & SENSOR_2_MIDDLE_MASK) {
              continue;
            }

            completedM += doneBeforeStop;
            currentSegmentDoneM = completedM;
            currentSegmentRemainingM = segDist - completedM;
            obstacleState = 0;
            break;
          }

          // Static front obstacle:
          // S2 is still active. Stop and wait for operator decision from
          // the merged sensor/mechanism ESP micro-ROS node:
          //   TOY      -> approach 12 cm, wait for mechanism task/homing, then continue
          //   OBSTACLE -> receiver performs avoidance, then path continues
          lastStaticObstacleMask = staticMask;

          uint8_t decision = waitForPiToyOrAutoObstacleDecision();
          if (decision == DECISION_NONE) {
            pathAborted = true;
            stopRobotHard();
            return false;
          }

          completedM += doneBeforeStop;

          if (decision == DECISION_TOY) {
            DebugSerial.println("TOY confirmed: moving forward 12 cm before mechanism task.");
            startMoveDistanceM(TOY_APPROACH_DISTANCE_M, TOY_APPROACH_SPEED_PERCENT, yaw);
            if (!waitMotionDoneNoObstacle()) {
              pathAborted = true;
              stopRobotHard();
              return false;
            }

            completedM += fabsf(moveDoneM);
            currentSegmentDoneM = completedM;
            currentSegmentRemainingM = fmaxf(0.0f, segDist - completedM);
            stopRobotHard();

            publishMechanismRunCommand();
            if (!waitForMechanismToFinish()) {
              pathAborted = true;
              stopRobotHard();
              return false;
            }

            // Toy was collected after the 12 cm approach. The robot stayed hard-stopped
            // during the mechanism task/homing wait; now resume normal path sensing.
            currentSegmentDoneM = completedM;
            currentSegmentRemainingM = fmaxf(0.0f, segDist - completedM);
            obstacleState = 0;
            break;
          }

          if (decision == DECISION_OBSTACLE) {
            int8_t side = decideAvoidSideFromMask(staticMask);

            // side == 0 here should only happen for an unexpected case.
            // Do not abort immediately; keep the robot stopped and re-evaluate.
            if (side == 0) {
              vTaskDelay(pdMS_TO_TICKS(50));
              continue;
            }

            clearConsumedDecision();

            if (!performAvoidance(side, yaw)) {
              pathAborted = true;
              stopRobotHard();
              return false;
            }

            completedM += AVOID_FORWARD_DISTANCE_M;
          }

          currentSegmentDoneM = completedM;
          currentSegmentRemainingM = segDist - completedM;

          if (completedM >= segDist - DIST_TOLERANCE_M) {
            stopRobotHard();
            obstacleState = 0;
            return true;
          }

          obstacleState = 0;
          break;
        }

        break;
      }

      if (pathAborted) {
        stopRobotHard();
        return false;
      }

      vTaskDelay(pdMS_TO_TICKS(5));
    }
  }

  return true;
}

bool runTurnToYaw(float targetYawDeg) {
  startTurnAbsoluteDeg(targetYawDeg, TURN_SPEED_PERCENT);
  return waitMotionDoneNoObstacle();
}

// =====================================================
// RTOS Tasks
// =====================================================

// Sensor data now arrives through micro-ROS subscriptions.
// ESP-to-ESP I2C polling was removed; Wire is used only for the local MPU6050 IMU.
void taskPredefinedPath(void* pv) {
  vTaskDelay(pdMS_TO_TICKS(1500));

  // Safety gate: do not start moving until the Sensor/Mechanism ESP32
  // has actually published through ROS. If it is disconnected, the robot stays stopped.
  while (rosSensorMaskRxCount == 0 || rosMechanismRxCount == 0) {
    stopRobotHard();
    vTaskDelay(pdMS_TO_TICKS(100));
  }

  // Initial mechanism homing gate:
  // Sensor/Mechanism ESP32 must complete Stepper 1 homing first, then Stepper 2 homing.
  // Path starts only when mechanism state is safe: IDLE or DONE.
  // If homing reports ERROR, the robot must not move.
  while (true) {
    stopRobotHard();

    uint8_t ms = mechanismState;
    if (ms == MECH_STATE_ERROR) {
      DebugSerial.println("ERROR: initial mechanism homing failed. Robot path will not start.");
      pathRunning = false;
      pathFinished = false;
      pathAborted = true;
      vTaskDelete(NULL);
      return;
    }

    if (ms == MECH_STATE_IDLE || ms == MECH_STATE_DONE) {
      break;
    }

    vTaskDelay(pdMS_TO_TICKS(100));
  }

waitForGuiAutoStart:
  // AUTO is the default GUI mode. The first run starts after GUI AUTO_START.
  // After a clean mission finish, AUTO mode restarts the path by itself.
  // GUI AUTO_ABORT still stops the current path and prevents automatic restart.
  pathRunning=false;
  if (!pathFinished && !pathAborted) currentPathStep=0;
  while (true) {
    if (guiMode == GUI_MODE_MANUAL) {
      autoStartRequested = false;
      autoAbortRequested = false;
      vTaskDelay(pdMS_TO_TICKS(50));
      continue;
    }

    stopRobotHard();

    bool restartAfterCleanFinish = pathFinished && !pathAborted && !autoAbortRequested;

    if (guiMode == GUI_MODE_AUTO && (autoStartRequested || restartAfterCleanFinish)) {
      if (!isImuLiveNow()) {
        autoStartRequested = false;
        autoAbortRequested = false;
        pathAborted = true;
        pathFinished = false;
        currentPathStep = 0;
        vTaskDelay(pdMS_TO_TICKS(50));
        continue;
      }

      autoStartRequested = false;
      autoAbortRequested = false;
      pathAborted = false;
      pathFinished = false;
      currentPathStep = 0;
      break;
    }

    vTaskDelay(pdMS_TO_TICKS(50));
  }

  pathRunning=true; pathFinished=false; pathAborted=false;
  obstacleState=0; lastStaticObstacleMask=0; lastAvoidSide=0;

  currentPathStep=1;
  if (!runForwardSegmentWithAvoidance(2.77f,   0.0f)) goto pathStop;
  currentPathStep=2;
  if (!runTurnToYaw(90.0f))                          goto pathStop;
  currentPathStep=3;
  if (!runForwardSegmentWithAvoidance(1.55f,  90.0f)) goto pathStop;
  currentPathStep=4;
  if (!runTurnToYaw(-180.0f))                        goto pathStop;
  currentPathStep=5;
  if (!runForwardSegmentWithAvoidance(2.77f,-180.0f)) goto pathStop;
  currentPathStep=6;
  if (!runTurnToYaw(-90.0f))                         goto pathStop;
  currentPathStep=7;
  if (!runForwardSegmentWithAvoidance(1.55f, -90.0f)) goto pathStop;
  currentPathStep=8;
  if (!runTurnToYaw(0.0f))                           goto pathStop;

  currentPathStep=9;
  stopRobotHard(); pathFinished=true; pathRunning=false; obstacleState=0;
  autoStartRequested = false;
  vTaskDelay(pdMS_TO_TICKS(AUTO_RESTART_AFTER_FINISH_MS));
  goto waitForGuiAutoStart;

