makarioussafa/Rovey_Mobile_Robot/Hardware_Codes/PID_ESP32_USB_SERIAL_ROS2_GUI_TCP_IMU_DIAG__copy_20260618051121.ino
pathStop:
  stopRobotHard(); pathRunning=false;
  if (!pathFinished) pathAborted=true;
  autoStartRequested = false;
  goto waitForGuiAutoStart;
}

void taskIMU(void* pv) {
  lastImuMicros=micros();
  while (true) {
    if (imuCalibrationRequested) { imuCalibrationRequested=false; calibrateMPU(IMU_CAL_SAMPLES); }
    updateIMU();
    vTaskDelay(pdMS_TO_TICKS(IMU_TASK_MS));
  }
}

void taskPlanner(void* pv) {
  TickType_t t=xTaskGetTickCount();
  while (true) { updateMotionPlanner(); vTaskDelayUntil(&t, pdMS_TO_TICKS(1000/PLANNER_HZ)); }
}

void taskProfile(void* pv) {
  TickType_t t=xTaskGetTickCount();
  while (true) {
    const float av=(MAX_MPS/ACCEL_TIME)  *PID_DT;
    const float dv=(MAX_MPS/DECEL_TIME)  *PID_DT;
    const float aw=(MAX_WZ/ACCEL_TIME_W) *PID_DT;
    const float dw=(MAX_WZ/DECEL_TIME_W) *PID_DT;
    bool decX=(profVx>0&&targVx<profVx)||(profVx<0&&targVx>profVx);
    bool decY=(profVy>0&&targVy<profVy)||(profVy<0&&targVy>profVy);
    bool decW=(profWz>0&&targWz<profWz)||(profWz<0&&targWz>profWz);
    profVx=stepToward(profVx,targVx,decX?dv:av);
    profVy=stepToward(profVy,targVy,decY?dv:av);
    profWz=stepToward(profWz,targWz,decW?dw:aw);
    mecanumIK(profVx,profVy,profWz);
    vTaskDelayUntil(&t, pdMS_TO_TICKS(1000/PID_HZ));
  }
}

void taskWheelPID(void* pv) {
  int32_t prev[4]={0,0,0,0};
  uint32_t seenEncoderResetGeneration = encoderResetGeneration;
  TickType_t t=xTaskGetTickCount();
  while (true) {
    int32_t snap[4]; readTicks(snap);
    if (seenEncoderResetGeneration != encoderResetGeneration) {
      seenEncoderResetGeneration = encoderResetGeneration;
      for (int i=0; i<4; i++) {
        prev[i]=snap[i];
        measuredRad[i]=0.0f;
        resetPid(i);
        motorWrite(i,0);
      }
      vTaskDelayUntil(&t, pdMS_TO_TICKS(1000/PID_HZ));
      continue;
    }

    bool zeroDriveCommand =
      fabsf(targVx) < 0.001f && fabsf(targVy) < 0.001f && fabsf(targWz) < 0.001f &&
      fabsf(profVx) < 0.001f && fabsf(profVy) < 0.001f && fabsf(profWz) < 0.001f;

    for (int i=0; i<4; i++) {
      float meas=((float)(snap[i]-prev[i])/CPR[i])*(2.0f*PI)/PID_DT;
      prev[i]=snap[i]; measuredRad[i]=meas;
      float sp = setpointRad[i];
      if (zeroDriveCommand && fabsf(sp)<0.01f) {
        measuredRad[i]=0.0f;
        resetPid(i);
        resetWheelRecovery(i);
        motorWrite(i,0);
        continue;
      }
      if (fabsf(sp)<0.01f && fabsf(meas)<1.0f) {
        resetPid(i);
        resetWheelRecovery(i);
        motorWrite(i,0);
        continue;
      }
      updateWheelResponseRecovery(i, sp, meas);
      int16_t pidPwm = (int16_t)pidCompute(i, sp, meas);
      motorWrite(i, applyWheelRecoveryAssist(i, pidPwm, sp));
    }
    vTaskDelayUntil(&t, pdMS_TO_TICKS(1000/PID_HZ));
  }
}

void taskOdom(void* pv) {
  int32_t prev[4]={0,0,0,0};
  uint32_t seenEncoderResetGeneration = encoderResetGeneration;
  TickType_t t=xTaskGetTickCount();
  while (true) {
    int32_t snap[4]; readTicks(snap);
    if (seenEncoderResetGeneration != encoderResetGeneration) {
      seenEncoderResetGeneration = encoderResetGeneration;
      for (int i=0; i<4; i++) prev[i]=snap[i];
      vTaskDelayUntil(&t, pdMS_TO_TICKS(1000/PID_HZ));
      continue;
    }
    float w[4];
    for (int i=0; i<4; i++) { w[i]=((float)(snap[i]-prev[i])/CPR[i])*(2.0f*PI)/PID_DT; prev[i]=snap[i]; }
    float vxB=WHEEL_R/4.0f*(w[W_FL]+w[W_FR]+w[W_BL]+w[W_BR]);
    float vyB=WHEEL_R/4.0f*(-w[W_FL]+w[W_FR]+w[W_BL]-w[W_BR]);
    float th=imuYawDeg*PI/180.0f;
    odomX+=(vxB*cosf(th)-vyB*sinf(th))*PID_DT;
    odomY+=(vxB*sinf(th)+vyB*cosf(th))*PID_DT;
    vTaskDelayUntil(&t, pdMS_TO_TICKS(1000/PID_HZ));
  }
}

void taskPrint(void* pv) {
  TickType_t t=xTaskGetTickCount();
  while (true) {
    int32_t snap[4]; readTicks(snap);
    DebugSerial.println();
    DebugSerial.println("========= ESP32 MECANUM PATH ROBOT =========");
    DebugSerial.printf("Mode: %s | Speed: %.0f%% | Goal: %s\n",
                  modeName(robotMode),gSpd*100.0f,goalReached?"YES":"NO");
    DebugSerial.printf("Path:  step=%d (%s)\n",
                  currentPathStep,pathStepName(currentPathStep));
    DebugSerial.printf("       running=%s | finished=%s | aborted=%s\n",
                  pathRunning?"YES":"NO",pathFinished?"YES":"NO",pathAborted?"YES":"NO");
    DebugSerial.printf("Obstacle: state=%d [%s]\n",
                  obstacleState,obstacleStateName(obstacleState));
    DebugSerial.printf("          mask=0x%02X | lastStaticMask=0x%02X | avoidSide=%+d\n",
                  sensorMask,lastStaticObstacleMask,lastAvoidSide);
    DebugSerial.printf("ROS sensor rx: mask=%lu decision=%lu mech=%lu | clearTx=%lu armTx=%lu\n",
                  (unsigned long)rosSensorMaskRxCount,
                  (unsigned long)rosDecisionRxCount,
                  (unsigned long)rosMechanismRxCount,
                  (unsigned long)rosClearTxCount,
                  (unsigned long)rosArmTxCount);
    DebugSerial.printf("ROS pid status tx=%lu | command queue drops=%lu\n",
                  (unsigned long)rosPidStatusTxCount,
                  (unsigned long)rosCommandQueueDropCount);
    DebugSerial.printf("Segment: done=%.3f m | remaining=%.3f m\n",
                  currentSegmentDoneM,currentSegmentRemainingM);
    DebugSerial.printf("IMU: yaw=%.2f | pitch=%.2f | roll=%.2f | gz=%.3f deg/s\n",
                  imuYawDeg,imuPitchDeg,imuRollDeg,gyroZDegS);
    DebugSerial.printf("Odom: x=%.3f m | y=%.3f m | headErr=%.2f deg\n",
                  odomX,odomY,turnAngleErrorDeg);
    DebugSerial.printf("Target: Vx=%.3f Vy=%.3f Wz=%.3f\n",targVx,targVy,targWz);
    DebugSerial.printf("PWM: FL=%d FR=%d BL=%d BR=%d\n",
                  motorPwmOut[W_FL],motorPwmOut[W_FR],
                  motorPwmOut[W_BL],motorPwmOut[W_BR]);
    DebugSerial.printf("Recovery PWM: FL=%d FR=%d BL=%d BR=%d\n",
                  wheelRecoveryBoostPwm[W_FL],wheelRecoveryBoostPwm[W_FR],
                  wheelRecoveryBoostPwm[W_BL],wheelRecoveryBoostPwm[W_BR]);
    DebugSerial.println("Transport: USB serial micro-ROS @ 115200 baud");
    DebugSerial.println("=============================================");
    vTaskDelayUntil(&t, pdMS_TO_TICKS(1000));
  }
}

