makarioussafa/Rovey_Mobile_Robot/Hardware_Codes/PID_ESP32_USB_SERIAL_ROS2_GUI_TCP_IMU_DIAG__copy_20260618051121.ino
// =====================================================
// Setup
// =====================================================
void setup() {
  Serial.setRxBufferSize(2048);
  Serial.begin(MICRO_ROS_SERIAL_BAUD);  // Must match the micro-ROS agent -b value: 115200.
  delay(2000);
  DebugSerial.println();
  DebugSerial.println("=== ESP32 Mecanum PID + Encoders + MPU6050 + micro-ROS ===");
  DebugSerial.printf("Path speed: %.0f%% | Turn speed: %.0f%% | Avoid speed: %.0f%%\n", PATH_SPEED_PERCENT, TURN_SPEED_PERCENT, AVOID_SPEED_PERCENT);

  const uint8_t dirPins[]={FL_DN1,FL_DN2,FR_DN1,FR_DN2,BL_DN1,BL_DN2,BR_DN1,BR_DN2};
  for (uint8_t i=0; i<sizeof(dirPins); i++) { pinMode(dirPins[i],OUTPUT); digitalWrite(dirPins[i],LOW); }

  setupPwmPin(FL_PWM_PIN,FL_PWM_CH);
  setupPwmPin(FR_PWM_PIN,FR_PWM_CH);
  setupPwmPin(BL_PWM_PIN,BL_PWM_CH);
  setupPwmPin(BR_PWM_PIN,BR_PWM_CH);
  stopAllMotors();

  pinMode(FL_A,INPUT); pinMode(FL_B,INPUT);
  pinMode(FR_A,INPUT); pinMode(FR_B,INPUT);
  pinMode(BL_A,INPUT_PULLUP); pinMode(BL_B,INPUT_PULLUP);
  pinMode(BR_A,INPUT_PULLUP); pinMode(BR_B,INPUT_PULLUP);

  attachInterrupt(digitalPinToInterrupt(FL_A),isr_fl_a,CHANGE);
  attachInterrupt(digitalPinToInterrupt(FL_B),isr_fl_b,CHANGE);
  attachInterrupt(digitalPinToInterrupt(FR_A),isr_fr_a,CHANGE);
  attachInterrupt(digitalPinToInterrupt(FR_B),isr_fr_b,CHANGE);
  attachInterrupt(digitalPinToInterrupt(BL_A),isr_bl_a,CHANGE);
  attachInterrupt(digitalPinToInterrupt(BL_B),isr_bl_b,CHANGE);
  attachInterrupt(digitalPinToInterrupt(BR_A),isr_br_a,CHANGE);
  attachInterrupt(digitalPinToInterrupt(BR_B),isr_br_b,CHANGE);
  resetTicks();

  // Local I2C bus for MPU6050 only. ESP-to-ESP communication is USB serial micro-ROS through the Pi.
  Wire.begin(SDA_PIN, SCL_PIN);
  Wire.setClock(IMU_I2C_CLOCK_HZ);

  i2cMutex=xSemaphoreCreateMutex();
  if (!i2cMutex) { DebugSerial.println("FATAL: I2C mutex failed."); while(true) delay(1000); }

  rosCommandQueue = xQueueCreate(24, sizeof(RosCommand));
  if (!rosCommandQueue) { DebugSerial.println("FATAL: ROS command queue failed."); while(true) delay(1000); }

  if (initMPU()) {
    DebugSerial.println("MPU6050 initialized.");
    calibrateMPU(IMU_CAL_SAMPLES);
  } else {
    DebugSerial.println("MPU6050 FAILED."); imuReady=false;
  }

  DebugSerial.println("Starting USB serial micro-ROS transport to Raspberry Pi agent...");
  if (!setupMicroRosNode()) {
    DebugSerial.println("FATAL: micro-ROS setup failed. Check serial agent, device path, and baud rate.");
    while (true) delay(1000);
  }

  // Core 0 = communication + high-level path/obstacle logic
  xTaskCreatePinnedToCore(taskMicroRos,       "microros",8192, NULL, 3, NULL, 0);
  xTaskCreatePinnedToCore(taskPredefinedPath, "path",    6144, NULL, 2, NULL, 0);
  xTaskCreatePinnedToCore(taskPrint,          "print",   4096, NULL, 1, NULL, 0);

  // Core 1 = real-time movement/control
  xTaskCreatePinnedToCore(taskIMU,            "imu",     4096, NULL, 3, NULL, 1);
  xTaskCreatePinnedToCore(taskPlanner,        "planner", 3072, NULL, 3, NULL, 1);
  xTaskCreatePinnedToCore(taskProfile,        "profile", 3072, NULL, 3, NULL, 1);
  xTaskCreatePinnedToCore(taskOdom,           "odom",    3072, NULL, 2, NULL, 1);
  xTaskCreatePinnedToCore(taskWheelPID,       "pid",     4096, NULL, 4, NULL, 1);

  DebugSerial.println("All tasks started. AUTO is default; path waits for GUI START AUTO PATH.");
}

void loop() {
  vTaskDelay(portMAX_DELAY);
}
